using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.IO;
using System.Globalization;

namespace TestArticle
{
    static internal class Filter
    {

        static Dictionary<string, string> Map = new Dictionary<string, string>();
        static List<string> WhiteList = new List<string>();
        static bool inited = false;
        static string defaultWhiteList = @"`1234567890-=[]\;',./~!@#$%^&*()_+|}{"":?><
·、；‘’，。！￥…（）—：“”《》？
ABCDEFGHIJKLMNOPQRSTUVWXYZ abcdefghijklmnopqrstuvwxyz
工菚匿匞慝茙苷甙虦戒剗蓳蓲蘜盞蘳蘣苣丣葉苉蔕芽荛蘙蕥戔苆茿匶蒆莁式芅菆藂萾荫蘟茸芓匩邛卭蒸菡荪节藬莻茁芤艿菰蔯蓀蕯萨蘵薩匜蔭蒢芨茎匥芭蔘蓣蕷蓪芧苔葈鶜茅葇蓩芆荾莽蕻苊茇苃蔧藞葫蓐苈萇莀苦莾萘荂葳葴荐蔵茬苤蒧虁芣戎藉藕菴蘷若鄀蠚匲惹逽项荋蒇蕆項藏荿荙蒝藶茂芖蕨葜蕼萁莢匧蘛菶藄萶葚蓁茏荗弎葢莩菔芼萉薍获蕦莸荔蓞萠蒯荕巭蕏苴萲莇蓃藇苚薶﨟茄虋莥荻蔿蕣薆萖葋蕮藐艻蘨菜散功葄藤蕂虅蕕荽苏萸蒵蕡邯葧荸芸蓋芰甘薷蘎芏蕓葑茥芉蒖蒜苿著薹蘦薳蕾薣虂藚匵贰萳貳芌薵芜芫荺莰某甛蔷蕔薘藝爇蓺蓻芙薔蕶菱藿蓍荖弍蘾荆華荊茾鷨萅芚邼荎菿匡菾菁藸蓫蕤劻芋蓴蔫廿艹卄芐莍荁莄菫蘁葍蒚虉荳薑黃芾蓸颟蔶苪巧七匚匸蕙莱葬蕘塟薤茢薚薞茉廾丌蔜苹荚萋莖葝萐薾蕐荑瓨弌匤萛蔖萀茞茝菣藖薒菲匪韮薉繤蕜蘧芷苜囏荹蕋蘋蘃匷菽茮苇苫丗蘆藘蓾臣苢蔝帯歎莧萈藍薡艱難藈戁臡茈茳菃蕖葓范荡菠蔢菭菹莦萷蔆萍茪蔳蔋蘫莎东蕩蕰蘯蕅藻薀藩莐鸫萢蒎萡薄薸藫菏蒲莯落萿蔽虌汞蓱蓡薓葏菬薻蒅匯莈虃蕍蒤蒞茫薃蓅蒗蓽蕞皵莫驀鄚蓦募墓幕慕暮蟇摹謩萌蕑昔菛蒔荲莳划萺菖草蕳剒蕌蔄蔓蒀萬勱蠆躉邁蕄逪葛鹊鵲茰斮蘭菓菒蓝葃虄茧蔅郾匽鶠藺菎鞯韄鞲鞾鞴鞳韊靾韉鞢韈葺蕺鞁靸靶鞣靫叵鞑勒鞵鞱靻莂鞖鞋靯靬菋鞊韇韃尀勤鄞茣堇韁戜或惑懃靰觐覲鞕斳靺鞆歏彧鞐鞘戓鞺鞩鞜鞝革鞸靼鞮鞰鞨韅區毆敺鞙莒鞓甌剾虈鞼萼蕚鷗歐雚蕇鄿鞇匰蘄鞻匮鞅匱蒉蕢蒷莴靹靵韀鞍鞚鞠鞉鞔鞄鞫韂靮靳鞞鞡靪韆鞒鞽鞦鞂燕酀靽鞛鷰鞧嬊鞎鞀鞬靭靱鞭鞥鞈靲荶靴蓶靿鞃靷鞿鞟鞹蔮藣蔑茵蘮蒽葨莮薯苗薗匣茴蘽藟蘲虆蕒葸莲瞢薎鄸蘉甍顭夢薨萝鹋薥鶓菌蕗莡蔨匦蔞藪苬蒕莔蘿蔂藅蕽蘻英蘴鶧蓇黄苒冓斢斠苖黊黈蓒黇顜黅鷬遘觏黆覯茼匝萜繭芇顢莗荝萴苘萵薖蘡慐蓮苋蔪貢贡菵匭芮萞苠芑艺巨荱蔚莊匨蘠藯斲蔬葭葿蕸荍螶葦贳勚勩貰蕊巪乬蘂迣蔣枼苾芯蘗荬薜世蓼芵藋苨忒蘹荩苡蔗蓆蘱薠蓭菺蕿薱薦蔊蔰蕃匾萹菼蒾藀菧芦蘑蘼藦蔴苂炗薕蒌蓎薮菮蓙藨蔍薼蘪茡菪藔藼葖劳萓藛蒙蔻氋茔蒄萗鸏莞鹲蔲莹萱苎荢萣薲蔩菅荥萤蓂营荤葷茕藌蔤薴荧莺菀蓥蒬荦藭荣蒏苧芝茓荌蓉蓿藆蒮萦蠶朁芪荈鬵兓茋苑茒葾芶薝萏蔛葪薢茑菳藓茚蓟蔔荀敬莬葂苟茗蟼憼驚擎檠菟警萯藑苞菊蘚薊蘇炁蔦帶慸遰茤鴄蒭葱匢匫萄芴茐葡茆莪芕匹旡兂藰蒥芡蕵芍匛葼葩蓏萚苽菝莃蘤萆苩荴瓯葟茊蓵茱区莏薬葲芹苅匠茩蕪蘀蒛菗芞菦欧蒐鸥菢鴎鴱蔸菂藠蒱蔱薂葀艾菈萔蒑殴苵蓷藥匑藲茜蓕荰薽蔈蒪蘸苯莤蓜葙蕈艼菄苛莕藾藗蔌萰茦莿蕀蓛萙菥菻莆葽菘藮萊蒁苌邪莠医蕎殹醫瞖繄荞莑黳贀翳悘鷖蓬鹥芺嫛毉薙瑿牙蒩芊苼菙蓗莛薐董尧蘍翘薰薫荇蓰匴苲蒠莚蕱葕莉萫藒萂茖萭莵蔥蓖薇薁藢萩藊迓鸦藜蘒鴉蘓蘅蔾菞薭蓹蘌蕧蘒苳蒰苸萪蕛萎蘶葎萟雅蓯蘈蒣莓蘩攻荓蒴菤蓘萒葥藙荘苙蓤蒫蓔葁蘢莘蕫萻蔁薏菩蔀蔉莌蕲蔏蔐藡蒂蒡蒋蒟薋茨茭藱薪藽蒺蒹菨蔺苝蔇蕁艽莭菇薅荨蕭茟葘藎萧菉茹苕莙蕠蔒蒘菑菷芛芀切芄茛葌茘荵袃茷苍芁芿芟蓊葰茯葮萮匬蔡荟茌芢苻巬葵蒨荃莜蓨蓚蓧恭莶蔹苶芥葻蛬葆葊匼藵荅茽剳蘥蘞蘝薟匳薈苮菕輂巷孽芩葔蘬蒒莟躠菍糵蘖薛蒼苓拲茶荼荷鷋茠荏莋莅共蓓芬葠葐棻巫莝葅鵐遳觋鹀覡蓌苁花芲蕟蒊恐萑舊鞏聓蒦蛩劐跫蕉銎芃巩荭葒虇芎葞苰苭藧蒃荮蘏葤莼蒓苐蕴蘰茀藴蔃蘊蒳葯蕝药芗薌薿蘔蘕蔠苺蒻蒶荜芘孶蕬蒈茲戉酄茺颧顴勸蘐蒍藷蓑觀虀苄弋蔼薺萕荠藹蘘蒿藁藳貣藃芒荒莣荄葶薧歡鸢鹳鸛鳶蓠芳蘺蔟葹蔙芠莨蓈蓢萃苀蔎飌菸匟隿蓄虊蕹陿陈隁聝聀聶茻子孨芔孴顳陬孕聑孖耶艸聉阤陂陉郰聂颞埾聚夃鄹孡盈戤焣阭棸娶陖取隨隋墮隓隳嶞阨耾堕陏随陙呄陓陦隇阫承陌颇陾陑聏頗陭陝陜聗陇隱隉檃櫽阻阴聕毦聣阞隠隫阹耺孺隭陸陡皯际阱陼聐聴隯阮陵陚陆孑孒卫聙聽孲耳阷聇蚩旹隔陋陃阢隢隞陕妛陘隬陫阯耻陟骘騭阽隵鼐函顄隲陗丞卺脀巹烝氶隙隚逊尕阥孙陧阳隄刵隅陽隰亟凾焏叾聖陨聩隤隕聵职勐隈孟盁阵聘塦聃耼祟陣出隑孾粜糶欪孭阠了屮阝卩凵也孔耴巜乃孞隦恥阸隣隣耿阦褧聜辸院孮聢辽皹聹耽聍迆聺陀阺陒聸陷陥聎﨩孢皰陱鵈隝隖陊陶聦聊隐阪孤陴聛隍陎隗聭陻耵陳刴螴敶阿娿朶陠降陞阩陹陁聒聅阡陲隆隀阼聥聰隩阣孫愻遜孜職聠联隧墜鐆隊阧隴障隌陪聪隡隒隘孻隟限聬聡隂聄隃附坠際聧险阶險険隥陯陰孼蠥耹糱櫱辥聆阾除聁队陮雟聈墬乸聯階聨聫陛阰聮埅孓卪及隮孩陔聤﨤防阬颈劲弁矠刭迳鴘驱骁巯戏骤邓驰又叕敠毲骉剟鵽逫敪叒厽歠欼骖垒亝驿骚骀叠斚桑颡顙骏叄參毿叅剼遪絫驭厸双叁参毵奙畚预軬貵預骑骐驮勇勈驵甬恿通劝能頚圣怼骦对马骊矡覌矟厼驲蟊骒蚤邰台瓵驯刣怠乨炱迨驶枲辝巼骃驷圅骡骋岊观貟贠鹬氄劀矞鷸遹骣巴厶驅駴駥驊騹騲馵駏駵驧驠駆驩馳駬驟駊馺騷騃驂騒驈駘騳驫馻騥駿馭騎駓騵騞騻騏馱駹駄駀騪騱駔駪馯馶驖驦驝驍駤駍馷驑驪驢騑驉馬駫駲騨馹驆駻騠騔騍騴騉駛駽馴馽驒騾駰驛駟騦骗駚駎騆駉驨騧駧騁骟驏騢騛駶騽駜駃駅騙驎驜騸馿騼駝騌遤驞馾駒駠駣駨騮騊騘騶騀馰駁騩騜駈馸騡駯騣騋驃驔駷騕驕驴馲駞騈駱驄駳騬駇駢騚騂驓騿驣駾駮驥騯駋駸騄驌騝驗驋騤騇騟駗駙駩颿騐駖駼験騅駐驤驙駭驐駺馼骔驼允鸡豫驹鳮驺骝欢劺牟鴾驳骠予鶔矛柔鞪骛騖矣骄逘欸務奦熃堥瞀蝥暓骆骢嵍愗鹜鍪鶩楘婺敄骈骍骥骕骎艰驸骙验矜矝皴鵕逡夋骅难骓螚態熋熊驻叉骧骇碊遀毻左礚矼礷礴厲厝勵碏礍厪奩礣砸碤磺碽碟奆礞砹奁礡砑厊硗砌礤硴硔硭礶顾頋耷矷邦础帮砀幚厄破砐硁夿磉磣碜硧码唘翃碼礮礟厷镸厺友雄犮盋礪砈磊飆大靥飙猋磭碱砺厦磩厌奭硽砉砳剨厣奤黡硕碝碩厖硥魇磢碕礰套镽慧碶彗熭厮磡碪餍硤厐夶髰鬕戫髸鬗郁髢髶髲髳鬖鬍髮髪鬌髬鬊髵髦脣历鬅奟硼鬚辱有鄏鬐髻髨鬒胡髡砠髩髭砽辰髾髿礖蜃鬘鬄唇硞鬟鬛髯髷鬞髥鬓戞鄾迶鬃鬢髧鬡憂鹕鬇礸髱鶦鶘磶夯磘鬉鬂鬆鬎髤髟劯髼髺鬁鬏鬔敐長鬈鬜鬋龓鬝鬙鬀鬑髫鬣髹髠髽鬠髴磎鬤髣奔逩硣磕夽砝圧礝硅夳圶厓奎矸厈磌厧奈奢夲奲硈礌礂夸郀瓠綔刳匏鴮砖焘硳礵寿夺砆碐礭硓压研硦硏硎揅碔砘厔碃硺磚三戌硬感觱咸顑厨礓碛磧矹烕厉励磽砞厂厫丆磝砰硖威硜镾碡砙瓺瓳砡戛存礥奀厞奯奡甭在歪砋邳丕兏覔夒戚蹙顣慼丰否砧盃磠硵碵还硯鴀嫑夏礛不孬耩耯耢耤耟磲耔耚耙耛耨頛耰耗耡硝耝耞耕耘硄耫耜耒耥耖耦奫礃礑耬厰耧耮耱耓砂泵夵耪耠耣耭砅耲厚皕厭魘壓奛礀黶靨厴懕擪檿饜嬮厘百碍碮砷矵夰磵奄剦鵪鹌碣碭厬礘邫石夻右夼礹磾磒厛厑碨勔奋面礋靦砗蠠厍靣硘靧礧靤硱碅磥碘冇碳顨硸耎磆磞耏耐碉奝硐布硨厕而厠碢厙磑恧硙砚鸸鴯碋页頁碙耍硶磮磪砃碾郕乭镼尮臧尨尪嘏碬尷成碿尴尵礔盛尳尥尯磖尰怘尲尢尬磟砄尤礦砿盔磻碥砨磱礯磷礳矿灰礏磄硿磍硡碂碇碹礗迖达碗牵碦確砣砥碈磔奃厎克艳兢硊兣兡确勊勀兞兙尅鸪碒剋砲鴣鳫奓兛奅碀磂砍兝矽硪镹碑碷砶斫磃愿願厵厡原硃厒磈爽礩鷞礉磤镻礫磗磦硒砵厢矴碴磹奇厅敧攲砢剞鵸欹礎歴暦碄厯硹矺厇砤镺硚礄硾厜砟厏硟硌硇磇礇砾矻砭歷厤曆磿磫故硑厥劂蟨蹷憠鷢磀橜磙礈礢砬磋羍磰礒眘龎礲辜昚尞鷯遼鹩碚厗磳碰磅碲磸冭磏磁礠厩契砕肆硉齧碌洯蛪恝觢挈栔碯絜硍砼砓碁碫期舂朞憃基磜奉奏硂泰仄硷春砎剘蠢惷蜝碸硆礆厱磴赝碖贋甚矶戡勘斟卙尠砛磓夦惎歁砱欺贗鴈斯蟴砜棊硢秦其砏雁郟夾硲頰鵊綦矾奪諅奞碓奮礁磼龚聋砻垄砩礙砒磯袭砪詟戊龙礅硫砫犬戍太砯盇碻态奒硋硛迏碠硠碎砊砇狨臟臓毧腻腜膩肛胨猎舁膜貘獏氁腊臈獦膒貙臙玂猫貓朠獚朑脦朦獴犽獲毁臒狘獾膵貛郛服鵩孚狲猛朏貀胐犯肔乳犼肠猻嗠狓胫腏毶犸蜰胎亂獝覶辭肥獁狁毪猱腬狻朘脧肞膸肱胈脹猢脤胯狜胚肨豾脜狉脴獿獶夓肧腌貊腼須腝胹澃盨嬃媭頾须犹肬狵脄獂猗獗獠膫猰腠狹脥獉猉胧肽肰犾脬月脅毝毳膬脇朤勰劦姭舀脟狙朋猨獀膄鹏臢臜猊貎腉鵬獡毨猺肋肜猙脮胁腴膎貕獖膹脖肢脚胠臑頱獳胿肚肝犴豻虢狋猪肼橥猿狤膨臌腩肟朊豺犲寽膤肤毀鶏臛狫肘肫县胵悬爰且鶢助猜腈遯豚脿膞狂毬脙狟貆刞膈腷脰肺犻脼舃逛膮獟鵟鴡獓狭胓脛脻雎獮胰膆猇叟鄋臔遚腓毴猅獩臄胩貜玃臞毡丯用胋臚獹胪覓覒辵頿礜舉胱與毜猀膛盥轝歟鸒脳擧獙猟膌譽狸貍貋猂胆狚膶狮刖胂猖蠫腽獌腢猲腸猓腂腥猩猑独郜驾駕頶狷毠勂告加脵脭靠肿狆臊腭玁貚贺賀脶膭乫造迦鹄鵠鴐架哿妿胑嗧袈膕胭舅猬猥腲舆獧腘胛狎腮毸獨臅猡爵貗膢膃玀腆膿猠胦貒腨猯猾爯腗狦興輿臖舋狪胴爨爂釁璺帠腡猧膼觅獑肭朒獕豽膗狈狽鼴鼠鼣腒鼫鼥鼷狃鼭峱鼯腛鼱猸貑腵猳鼳脲鼹鼺鼬鼰肊劜鼵鼲鼧鼩鼶力鼪鼮鼨鼸甩鼦膠鼢胒狔鼤臎獷爳鄬猏脏毩爲噕膰猵悐毯腅逖朥膦獜犷臁獛膅腑毇膔臕狄脒腔黌臗學斅斆受辤爱迌礐脓边嚳狩壆腙猔脘腚膣腟獱臏覺澩猽嶨腪愛獰燢腕觷舜鱟鷽膑狞胺雤狖貁胝兒先郳脃脆膽赞酇酂劗贊兟獬氇狝狣朓脁狥毥狗朐胊豿脕胞褜狍舄毱氌选鶂胸脗肳狰肷豹肑犳猣朡狐胍脪獆狶脈脾貏猈腯貃胉狛肵脌腺獔膴遥繇颻猘鷂鹞飖貌邈狾脎獥胅毢彩膊膘猼猹腖獭胢獺脨采腰膝猍脯狇胀胮胣狏狧獢膖狅腄脡腫狌胜腁獯臐胻臼胙獋脠狿腹猁脷膓胳貉狢貔膍肐犵犭胏彡貈腇脢爫豸胼膱腃腾騰朕勝塍獇猐膳羘胖膡滕朧臆獞朣膧腤獐獍螣脱毰黱賸幐氆膀腣膪鰧狡胶猶榺媵膁獈貖膉縢謄妥墾毽肗貄腱爭貂獵臘犰肍懇腿鵎腦貇肒犱狠肕股猞腶胗腧貐毺脍狯肸胕猤肹脸臾办猃猦脫臉獫膾膯獪腀肌獅猴腍肣膇惥獊朎狑狳貅斞肦朌脞腳脽猚臇膲奚谿鷄雞腞狕猭獼乿脂狒胇膙猕膷狴豼肶胟朜脝獤狱鸑獄狺犿猄脐臍獽膻氊脉胲脑肪狼朖肮猝脺犺腋臃膟胘霰坩卋鼖雸墸壒尭臷墷韯卉塻蛓堰霸墐域哉塸载戴贲載霙翸賁胾歕墴堞烖靀墆栽酨桒枽截塨塔塂埖垬裁壦塃郣勃愂孝孛壭凷地逇鹁鵓场垜教霳壣坡雭圾弆却叝墋頍动叆攰埇劫云刦朅坮唟盍霱翅运迲鳷魂雺埃霧霿霚支去刧攳叇刼埈鼁堶垹坺震雳坜垮堐堿坏坯墄埯坧雼壥需堧颥顬城墭垯塬塽埼壢靂堪墈埲堾埉垅雮垺堋協塪埒埓坥霾霓堄霢埰勎协霡墳壩邽邿坛霴靅霒霕霼靆靉雲壼壖劸封圭亖墵垚壵堼土幫幇鞤犎填埴卦款隷堵刲墘郌壊圬恚雩鄠壔奊霊坃寺墙墶墻堎鼃坉垤耊士埥豰圩埡塼二十墕耂雫圷垣埂塥堛壃考垭墝坪霋瑴坘塐墟邗霏顸頇壉矗直麉址圵垰埗埱刊干坫嗭盐壚塷垆垇悳惪迀鳱垷攼壏走真瞉颠顛鷏埧圤霟膥靋霮霄霪祘霈垙霑未壋埫霘礼霃霂釐孷氂漦犛嫠剺斄示霶垱墚塉霗霐霔戟都朝者壜塒坓埋垾亁埘坦堤韩刌坤覩汬墹霷井墁塭堣塌電乽翥韓乹煮煑进埸壛堨場斱堁乾鶾雗刱斡幹殾螒翰榦倝堒丼郆霵颉頡袁埍遠劼吉古喆嚞埕圳靈酃喪龗霝賷堮壧孁墠埙壝霣埚塤墤翓臺迼鴶欯嗀嗀霬壾皷皼堌彭甏蟚嘉鼓壹壴鼕雷鼚鼙鼞墿鼘瞽鼜鼛鼟靐尌堽鼔喜敼噽囍嚭憙熹歖靁夁賣皾覿亄鷧畞露懿塿堺塄霻献堓靊雵坱塴霌垌圸南坰堝塏垲遖堈轂埛埁墔坝垻坍壽魗翿垊燾亏堀逺霨墛堩韦霞壻堳覟墀夀圮圯圠迃声霫霹忈志塀壀亐块聲殸漀馨韾磬毊罄鏧撀謦坭专墌壙郝赧垿頳赫壸赭赪赬覝赨墦赮埮赯燅赩赥赦圹螫灻赤墣塘墉糓塶埪逵蠧槖堗壺垸霥塜垨埞塇靌塚过塓辻壷毂疐堚壶売埦堔坾垞垵壳殻塎悫慤坈靏坨壱坹坻坁元圥邧兘顽頑垝觳埳埆坖雿垗刓坸耇鼋堍雹坞垉塢鷇鵱远垑靎圽均鋆无埩霤塯坎黿圴堫坂坬埤塮堭坵圻垢墲塊墽坼博堙墂霜圢鸘鹴墰埬坷堜霖霦塛雬榖埔圫埄墧塳垁雾才霆埵圲壎堹垳埏垍鼒塲垎塩垧墺霺圪耉雽垀塖穀霉坆圦垪壌埢卖觌丧報雴瓡堘幸盩逹垃垟墡達垶坢壠靇境墥堷墇培增増啬墒墑塝壿墫霎霠塧赱騺驇勢墊雪垏壗埭漐蟄暬贄慹熱埽埐鷙摯摰槷堖縶執垠埶褺謺邞坄螜愨塕垘塅堬替鄼鄻坴辇輦賛坿墱規鬹槼嫢夫圿堸垥墖堢霯规埨鬶椝埠堠垖埝坅塠零坽鳺垛夌雰坋赍殼﨏嗇賫鼀墢堆霍鸖靍靃老毐坳耄堟耋塡索縠耆坲刬盏耈彀霛堦戋坶墩霩墎埻堉壞霅圡寸霭霁霽靄壤壇壈塙垓塆壕垴雱坊雯埌坑埣壪坟琖邢郉形玵瓂弐玒璍武鵡鹉虣弄亓型刑瑾幵开琙瑛璜貮璊玴烎璥鳽栞琊璓玡珙瓁瑹雃瓘瑘邨顿頓瓍珥邷旾击屯迍玚玻郅晉戩臻臶臹至玛臸到瑵珆璚瑪鵄玧瑈致臵丟叀瑚珛瓇瑊蠺蝅珬环玤珔忝天沗蚕瓸奣甅昋吞顼瑌頊珹迗鴌琦瓑璙琪璂琫瑃瑧珑琈郬豝豲靜豯珕豠瑫青靑豬豷豶豮櫫瑗玥豜豣豘豩珇燹甫靚豕靗璵蟸豱珈靓豭豟逐靛瑷璦静瓒靘豞瓚珗鶄瑶豨靔靝豧玏甤豵表豴瓱豤豛豖剢豥邘鄟珐亞瓀堊珪甎琧玕瑱琽剸琎蝁瓧于盂瓄惡璹瓙迂玩鵶鷒專専玞瓉珯珷瓲琶瑨尫琢豗玗瑼王玨璱五球璢珸一瑟玙璤琹璈玶琴珡琵瑇珏珁琥璨正琲頙璩焉鄢靕玮下琡琸玷瓛丅瓐丐忑乤丏璿現鴊政尶璼颪玼璖皳琑琺珖璫瑺盚琐瑣逑救慦珰珱裘求畱理曺瓼亘瑅刯瑁珅虺琩車瑥更郠甦瑒瓓瑆琨琝璟郚琄吾珵囊玔叓嚢蠹蟗橐櫜栆亜覀悪噩卅璪逼畐副疈鶝融鬲鞷鬸翮鷊鹝鬺鬴鬷璝逜吏敔事剚豇画郖頭珚毭豆豉環畺玾剅卌瓃逗豌琏西豍璐豏琾珿遭曹琠襾瑞勣再珃琱兩帀巿鳾迊雨珊両璎瓔璉现责責两邴丙瓗琌璀丽珼郦彨玬逦鹂珉瑉琚欤珝与瑕瑂瑋瓦玘玌戸珌攷惠恵忢丂玦璆夨璻亚慭垩灭来晋戬鄑璠赉恶琰璘严璞瑭麗酈彲鸝邐瑏迋辷琮琓瑄琔璸璌琯珲琿带璭琬瑸琛瑢殘殣殢琘殜堯殛殆殑卼顤殗殝殎殂万殍劢残殱殖殪殰琻殌殭殏殩歹珧珎列裂劽珣殟烈鴷鮤烮迾銐虿姴殒玽殫殞殨趸殬殃瓊瑍翹玸鳿瑦迈殯遶殡殥殉歿殙殦歾殊瑤歽殐歼珋殀殠殅殈殇殤殚殕兀琤兀肂殔瑠殓餮飱殁殄殲殮死玖珴玓殧瓪碧琋琕珀瑝珠丈璳瑔璑珤瑰瓆璬瓅玎末亍珂瓎唜瑓琳璴瑮琜璷聱琇骜驁獒琒麺麸玝瓩珽珩珄螯琍珞嗸瑀璁赘嶅珦贅琁熬遨鏊鳌瓈麹鷔鰲摮麦珘嫯瑽鼇珻敖玫謷夹郏刾颊頬瑐璲平琷珜瑳瓏璋璄琣璔瓋珓亊珶勁璕巠剄巰頸鵛逕婯坙璛珒妻郪疌璶鶈琭璅珺玿瑙珢玳玱玜瑖珍瑜珮珟玠珨璒璯爾壐蠒鸍邇覼璽玑瑡琀玪瑲玲兲玢瓰玐琟璡亙互瑑纛素繛瑻璏毒夷鴺玭瑎璣戈琉珫瓌珳斑琂玣琼玊玉璾瓖璮璃班璇琅瑯琗玹玟虐瞸睰虏皻虘覰瞒瞱眶趞瞙虞瞘鸆瞄矒瞞趪虑歫鬭鬬虙虚戯戱虛觑覷虡歔矇眍虗處虖歑虍虎彪虥矆甝鬨虪贙虧覤虝虤雐越眓虔矔趣龃龉眲龇齿龊趉龌龅龂龋龁龈龆龄龀孯硻腎堅豎韰皮蜸眙賢瞲粲鋻眸掔竪攴婜餐睃緊臤矋郹韨猆奜靟睚睳韭歲歳劌顪翽非盽蜚剕辈颐輩頤頣頉悲翡鶪棐瞭狊婓餥睶眬裴斐韬赲勮肯趄眀朢瞍豦劇眊瞬遽瞹睨趱趲鬩睬睜睵歧瞌眃眭歭睦瞋盰赶眛眎睹趌瞦盶矐瞡睖盹眰上丄睛盱鬥芈眐羋卝茍眄雈羐鬪凸眪赜賾瞔歵睐矖趔趬眜睫趰眱频颦顰臩頻頥瞁止目瞐歮赴趠趈丨亅矑愳臦煛燛瞾鷪睍步卡歨鼑瞿戵矍氍鸜眦卧督叔裻惄錖趙赻睄敊瞠矘趟歩縣眇懸尗瞯趕睅瞤旧趧睼眒卓瞷韫矙逴児鵫睗桌睲战梷奌頕睊占睈覘敁贒趮瞣矂獻觇甗鬳齾瞆瞶乩点迠眖戲睤趩虜膚盀覻趗盧顱鸕慮卣勴逌鹵鹺鹹鹶鹷鹻鹼鹸卤鹾禼卥睏瞜睓眏睭眮赸卨遉欳貞贞眠瞰鬫颅趐趘赳睱睸矚県凹兕巸熙煕鸬卢瞩忐媐起郻矅赽趯眤矌歯齢睙睒瞇瞵瞨瞊眯瞎趤肻睆睿叡壑壡睻矉瞚瞑违睴矃敹眈睕眝趆睧眂赿眡見覎瞻趛覞眺趒趂眴眗眳睌矎瞗趜鳪趨趍眵覐矏覹歺赹盷趋睁赼睋眅睎眽睥瞃盺趎赵赾瞴矈眣趃瞟盯瞫趚虨睞盬趏趫睡矄歱鹽覧臨監鑒覽擥譼矀盵趀瞅矁眨鍳歬瞛鬮睠趇眹鬦﨣眻眫矓瞳瞕鼎趑趦趥睇睷睩趢超眧門韧眼齖齰齛齱齝瞈齮趁齟齨睮齯眕齻齬睽盻齜睑齒齵齥瞼齶齞瞪瞺齫齪睔齷睺趝齓辪赺齳齣齙齺齗齭趓齼齽齲齚齕貝仧具齴齸齩盼凣齠齦齡趖睉齘齔瞧臥趡睢趭砦眑些祡眥歶呰啙赀貲胔此觜鈭鴜鮆矊柴姕雌飺紫訾瞮卜瞓鬧盳眿瞝眆睟眩盿淺漭渃澒颒頮潵泔濭湈满江澕懑洭漢淽灆灘漠濗澫灡漚漌淢渵瀎潢黉渶溝満懣滿汇泄洰渠渫瀳涝濛潆溁滢鸿滯潛灊濍懘鴻沤柒渮浇潇瀟沏洪濩溚港濸鍙滙泧灌浳淓灄滠溋瀡碆泐学洱汓滍涵洆凼濻泏池氾錃汤烫敩漋婆滁波汲泾滲涰渗澦滪涌湧慂泽沀汿溞治潏溤沇洠渘涘滩浚汊汉濿沷汯湱湖洧漘溽滣沥瀀涱浱涛洿渀涯沽減澸滅沣洊尜洡淹湹洦沰沯湎洏渜湏沋浝厳洃滟源漺渏瀝潦尖潔湛湊淎濝溙湷澌溱浹淇泷汰汱汏湼濦浮毟淝漪滔淜肖潴渓浖沮湲澙溲漞削揱浩喾泇灂潙逍涭灚洗濳灒淣潟鍌劣労滛淫氻淨浽溪鸂灞瀐泋渽濆溨瀻渤浡涍漖尝溘沄汥法濡尘坔坣澐湗洼洔汢淕洘汗汁淔滇沬沶潮澣濣渚汫瀚漧洁溒澎澍潱瀆湳污濤汚浾涜濲沅灀瀮瀔渎涬澾潜濇濽澪淩瀖浅瀫溹汧黋沌光洷添清濪瀞瀦涿汙盓漙汪潖濏沔泟漹浗洹澑浭尡浯灢瀜湢滆浢渍洅淸沛沞漕漬耀韑汅潓灑溍兤涞辉滞輝洌澆沫滶浃泙淒涇濔溼沍溸洟滤澞滮滹淲瀣澯湨渄濊澽省泪沚涉澁濒瀕灈淑渺渉渋淖沾惉濾瀘滷浈湞泸洍濬覚覍涀濫小瀶灠濎濉泚雀蠽氺濷硰消洸洲渻淼水尛渁涾澢漟灙淌溑乷逤鲨鯊挲桬沙潎泶娑裟沝瀑滭渱沓溡濹涅浬涆濐汩汨潤鼝淏淂淵泹湜浉滉虩澗淐灛漫温澷湡溻湿渴渇湯灁盪燙璗淉瀾巣澖滥濶湦蛍灍混灦濕洩浊灗澋灏灝潣渂甞牚湒濈浥涓堂呇浧洖塣瓽沖汌渑澡営澏漶湂當潬劏黨赏常瀢賞涡溃潰溳涢党況掌棠嘗裳淠戦漍潩涸洇瀱渭渨潈澤畓畄泴濖泗沺獣溷澴涠単洄灅潿涟濁渐涃潞溿漊溫泅溭潀漯浞潶濃濺灔浀灎澧淟泱湍灧漄灃灩湠滑漰油淍涄溅洞澂汕测測峃瀃潉尚尙氅渦泂幤濄敞溰瀴漣漴觉漸聻魙壍嬱溄潂涔瀭浻溦漼汭浿浵泯澱湣潺尐淈澉泼涺浘漏沑汛潳渥汈湄溊湑灟漽湋泀浺瀷涮汜沜潠瀈漝泌湉澼泦決漻濯泥埿沢沁濢瀥浕泤瀇渡淚涙濧灋瀍滬潘瀵淡澇瀠濴瀯濙灐濚瀅潾淭灖沪濂灇澲溏溇滽漮漉瀌沩洣涳滘湥浤瀗涋浓瀉淙滱溕漥浫浣泻潌渲淀濱演涫漃溟渖浑渾濘澝濵滵淧瀋沈涴滨溛浶深泞浨滓洝濅沉溶瀽沱泬汦涽滐泜沟沒澹洈淊澥鸴渔淦鲎澛洮沵洵浼潒泃洺瀺涣渙泡漁瀂鴬溩淗濥淘洶淴沕泖汮溜浄瀏盜湚汐涐渹汣汋汹汳泒淆湃滜浠派澔渒垽泊湟浜沂汼沠洙湶洉潕峾淿淛汽滊溾浙激溵泆湁潅濼漑泝涁漂溎湮渿溥酒洒泍湘汀渣潭涷河溂滒濑瀨瀬潄漱涑湅洓潥淅灪湐淋潸漜濋澿澘潹漤溧滼栄漆淶淞瀒沐浦沭弊洚汑澨沲活浲潪漨鋈獘沃滗少汻涶汘涏斃泩湩洐湰瞥濞溴泎洎漇涎乑潲浰暼漡蟞洛鄨渪蹩洫潨漗澳幣澚瀓憋汔泺泲渊湫泛鳖鷩鱉鐅撆涤龞潃澓泈泘瀊溗洀潷瀄嫳涹潻漎瀩海彆鼈塰瀿敝汷洴渆溯淃滚浂渕湔湇澻溬瀁泣渞溠渼润洋漾溔湵泮漛瀧漳潼涧湆灨澺滝滰涪滾渷涚潧滴滳潽湴滂渧澬洨滧澜澊湭瀙澵浐滻溓淁濓溢滋潫濨涕溉潯浔当澅潚津汝堻湽湕濜渌漅沼洳涒灉淄氿浸染梁粱涩泿汍澀涊浌沧没滃洑涻脊渝洕鶺鹡沴浍漈溌泭举湀洤鼡洬滌滫滺浟潋渢沿渰洽瀹潝涗湺瀲澰澄澮淪汵溮浛淰滄濮泠滏挙沨涂溆潊塗漵兴氼涖汾湓洢湌浴瀸溣沦潑沎誉淮汃汄準盕潐潗汎渳泓漲湪泑澠瀰淥沸漒涨溺潍濰沘湝淳漷涥潡流淯鎏澈瑬瀛灜溈瀤注滖乼汴涼济浏濟済湻瀼澶澟滈泳汒湾湙滦洂濠渟湸漓灕游汸湤浒滸漩浪液淬沆淤灣滀灤泫澭汶氵暱蠂昻蟒蠎昮畢蚶鷝虹曅曄螨暵蜡蟆暯蠇蝘蜮閾螼曣蠛蠴蟥蝧暎蜹曂蟎暪蝶蚷昛煚蠓曚蝾螮曔蚜閕蛲晓蠮蟏蠨暴闀蠖閧謈晎蠸最聞朂虸蜬蟶蜢昢曓虵旸蚾昅昪閞蝃肾蛹坚蛏蚂贤蚆闖螞蛑蝚竖晙紧蠣曞蚅閎蛂閆暳蝴蛕鷐晨蜄蝰晇蛄蟵蛎蝛蚌蚽閹蛨昦晻蝒蝢蝡暊晟晠蛖蚘螈旲暸蟟蟩蜞蜯蝽暙蟖螓昃蛺昽蜉閒閰猒蛠冐蛶暖蚏明蝯勗蛆琞螋覵晧盟蚝蟡焽暧曌閿曖蜺晲暚閐螇暁蟦蠘野蜐墅闔昙蚑里蠕曘黙蛙閨曇圼晆時旱旪旰虷閈闐昧暑闍蝫暏蛣闧蟛曀蟢暿蝻暔黒蚖閉蟽闥蚨闚曤蛯螧时開蚈旽蛭晊昊閏閂晴蜻旦閸虶旴暷旺蚟题昰韪閇尟韙題鶗遈晸是匙虾蛷量晅蝠晤曧螎鼌闘师昁螬蛃昺昞蜽蟪曬曉蛚蟯鴠昜昩蛱蚲閛蜨蛵鼂螦蛦蝳閠畅闃暃勖毷冒蝆蠼闅刂蠷暢晫申曱蛅曥蠦曰早迧蜆晛畃朄蟕虲蟝蛸晄晃閖閯螳闛蟐蟷闣曭闊蝋曝間闁昌晘蛳蚎昍蜵蝭覸蝐閩晶閶曟曑晿曡日蠱蝿曐蟲蝹蟃闒焸暥蝎暍鷼蜴晹蠍蝪暘蜾暒蜫閺暻問蜎蜈冔蚛蝇闆閭曮蟬暺闡蜗闠蟈曼鄤蝟蛊昷蠌曎曙蝈蜖蠉闤閘蛔蠝蠋閫蜠螻螺曪蟔蛐闦晪映颙顒螖蚰蚺蚦蜩晭晍帅蛼禺閴旵蝸閊閳螘闓暟蠳愚遇蚬蛧螹闝蝄蚋蠵蛽蚒闞蜛毾蛡暅暇蝦蝑蝞虯悶曯蠾闈暐虬蟤遢蝂閟闢电曜蟉蠗蚗昵蚭蚇蟅曠昿蜧顕显焛闙蟠蝙蟋晱蠑蟧暽旷昈炅蝷曗蠊蝼螗螰炚螛曢晥暄螲蝖蝊蠙螾暝螟晕晖暈暉蜿晼晏鷃蛇蚔曻閽蚳昂蟾蛫曕閻蜭蠏晁晀冕蟓昫蚼晩晚煦蜔蝜蚫螐蛥易敡剔蜪惖鶍逷昒蟂昴昀蚐歇毼曷鶡遏鹖欥蛾虳旳蝬昄蛌暤晞蜱蝗蚯昕蚚螔蛛暭闎蟱暣逿螝晣敭曒昳蛈蚸颗閪顆褁螵闉晒虰敤閑果蟫曋蝀蚵閅閜蝲闌暕夥晰蜥晽杲闄蜙晡蜅蚞昇虴戥蜏蜂蛞蜘蟜閁蜓星旿閮甠﨡蝩曛昨螑蚱曍晷螅蜒暞闑临蜊蟍蝮閣蛒蝺监蟌螕览晌晑虼蜁鉴蝌昸蜲暰晦暀蛢蟙蜷闂闕関閚蚪昱閗蜣曦暛蛘蟮蟻曨蠬蟑闇曈暗暲閲蜕蝉螪螃蠀蛟晈蝤螏昗螊螠螆晜蟳旯蝍妟蟰归曃照昭蛁蠟螁虭旫蛝閥蟘蚮蚣螉暡昖蝓昣蚹暩暌闋螩閃蚧闏閱閤蛤闟蛻蜦虮螄晗蛿蚙昑螥蛉閝昤蚥蜍昐蚡蛜閦晔閄蠄閵蜼蟭暹曳蚴蝝蠅蚓昲曊關曏顯昆蜌蚍闗鵾鹍蝔蟣歞曵暾蜳蜟誾閍蠩蛀景閔影颢顥晾蛴蠐曩蠰蟺閙暠虻閡昹晐蠔蝏蚁昘螭蝣昉蚄暆暶旻螂閬蜋蚢蜶晬閼閌蟀蚿昡蚊旼喏咁囈哐叿嘩嘆噶嗼唶囆噧嘞嚡嘔嚥喵咂唝嗊呓呭喋唠囌噆哎呕呀哓囒哄嚄嚿嗒嗬嗏嚾嚆囁嗫唨咠嗤咡吇叩咄吼吔啊戢吸邑嗓啜嘇嗵吗咍噊吧嗎吮哞唉唆叹咗呃吰嚖嘒呖嘠喐嗕哊嚘喹喯啀咵咕喊喴呸嘎嘁嗄吥喱嚈咟唵喕顺咘順哤咴哒嚦嘹噘喫噄囓嘶唪啿嗪唊唭咙吠呔哹啂嗋肙哷咀喛瓹嗖别剈咖哠嚼唙噅嗳噯鹃囋唲鵑另嗂啋叻哸嗘喷噴哮哱哋嘋吱嗑呿呍嚅哇啩吐嗔叶唗味呩嘲嘟啫咭鄙嘭噎嚏嚔嘻啚喃嚋哧嚇呒噠啈嚯呋嗜嗦咾吋哢咞吨郢噸咥吴啄啨呈啞吁噁噖吓嘕哽咺唔囔唖嗝哣啧嘈唡嘖啢号號鴞鸮饕飸哑囇逞咧嘵嗷嚽唛呯啑啛咦嗉咓嘘噳嘑噓唬啮啡噦噱啃虫哶咔嚬啅呫中囐盅嚱嚧忠遣噛迚哯囕嚂足嚙嘴呲喍卟啵嘙哨咣唦噹嘡嚐唢嗩嗨吵嗶嚗嘬哩嘢哻呾呻唱嗢喁黾喝嚪啺嗮虽喅雖噐郘骂駡唈器嚴嚣囂嚻哭哵吕鄂卾颚顎咢鶚遌鹗覨吅呺串嚚患喌丳噪品鄵氉劋碞口嵒喦喿獸嘽嘼鼍鼉嘳嘂斝呪遻咒呮戰嘓鄲咽辴嗯喂喟啭嚜呬噮啯呷嚸嚃單嘪囅啰噣鷤嚺嘍囉嘿哫噥唺郧鄖喘嘊啱咉勋嘣嗗勛啁呥哃囀吊唓喎嘤嚶嗣翤遗遺嗹哕鶰吶贵貴員员囎呐呙剐嗺呗唄呡噉啒吳啹吜哪喔叼呉叫囑呞喡唰噀嘱咇噼吷嘐嚁呢吣噿呎嗻喥嚝唳嚉噃呝啖嘮噒嘛嚰嚤嚒噗喽嘃咪吙啌嗐哝唍喧啶喗嚀嘧啘哰咛喀咤噾咹嚓噻咜呧兄嘫噡唃嘝啗鸣唫噜咷別咰呴喣嚵唤喚呜咆鳴嚕嗚哆吻哅啕唿嘄呁喼嚠吹焁哦唣呱唏嗥哌啤唕喤吽听啣哖嗁史噑咮嘸嚹啲啪哳咑噭啦唞呹嚛喞喖嘌哂唒呠叮喳嘾呵喇槑嗽唽啉噤嘜呆喓唻哺噬呏吒唀咶嘺唾喢吘吀喠嚑哘咱嚊嗅咋嘷川嘥喒唌嘚唎咯呂啝囖响噢吃啾嚟呼咚唩咊呚叺嗍啳咲喭呌嗴唴咩嗟吖嚨喑噇噫噷哾噌啴嘀啼嗙咬噂嚫噺唼嗛嗌唥嗞嘅噚唧呶嘯嚍啸嗈嘨唚叧叨吚哏呛咃嗡吺啥喻喩咐哙吤哈啽噏嗱噞噔嗰噲吟叽喉唅嗿唸嗆呤嗲咻哬嘦哚唋喺只吩咿喰唑唂哗吪唯叭噙噍鷕喙呦吲咈叱喲哟嚩哛咝哔噝吡喈嘰吆呣哼啍噋唷唁噈哜嚌嚷嗃咳咏嚎喨囄嗾啷哴吭啐唹囃呟噰呅踐轼蹃躤躇黚蹒畀踖羃躪羁國罭爴羇羈蹣距跇蹀黖蹛跷躏異黓躡蹑踙囝黜辄踂跥跛趿轻轰辍罬畷黲黪踊踴圗囜跆囼圎蹫跁罵罞蹂黢踆畯罷羆轭跋固囿跨罟畴踌轱跍蹰黬罘囨踎因罨黤跖盢恩罽跶欭畸踦蹶蹽辏蹖踳黮踸踑默畎轪罦蹈胃跀罝跙跏跣躜躦男踩畏嬲蹊踍罢囩踋圔罴跂墨罣畦跬罫畤跱踛置轩黰蹎跿団跊署踷畊囲園辕瞏黠黷罱转躊疇黑园团黩圉睪鸅躂斁歝趺踜畉践趼囤黗轾跮囯圊圂慁團趶罡囸還辐圄睘踾翾鹮疅辆蹧蹟车躧蹺踕踁躎跠国罪躆趾踄躩踧罩踔围點跕黸甲囗囬罒皿四轳躣跐踃塁囦踏蹚遝疂眔蹐罼蹕踶辒蹋踢踼畼踝躝辊跩辑回罥圖甽躁圆圓圚蹪迴廻轵礨壘畕圛圜畾〇奰壨田罳疊氎疉躅鸓罍櫐纍踀圐跚踹圌蹦轴畘踻蹥鷶買辋辗罠蹍囻踞囙顋罻翈圍轧跼跽蹡思躃罹躍蹘疁趹跜踱蹠躕踮躔蹯蹁辚疄蹸蹼辘蹗辖逥廽躥畳踪蹿连畹黦踠黕蹜跎跪蹨黵鸭跳蜀斀斣劅鸀歜跔跑鴨鴫踘逻黟跢囫罗畇蹓踭软趵罶畂畈罛畖堑踲踬斩蹏跦暂躌錾躓椠躈轶跌躒跅躚蹮圑黫跴町圃困甼蹅轲跒踈罧辅跭跃轿踟蹻跹踵畽蹝囷略畧辂路踽鷺鹭跞轹趷踿图轷辀踒蹤黣踇畮畋跰圈踡踯畻蹉畔跘躨躘黯疃蹱罿罯躢踣蹭罾蹢圏踫蹄跤図较蹲躑踥躙罤囡氀婁圕踺甊罺轺辎躐轨遱蹆鷜數轫跟跄圙输踰轸畛跈跗囶辁跧囚界畍跲黭蹹蹬囧朙踚圇黔踗趻蹌囹跉跺畭畟眾踨轮蹳囵囮趴圀踓罖蹞黝羄累羂躀邏羅毗辔毘跸躖蹾辙圁畩詈罸跓罜蹴黥辌罰罚躋跻躟畡甿跡躞趽踉囥踤羉圝圞賤軾輚贼曲農贜蠈賊嵌屸鄷艶豊軭豑岽刪贎嶱轕轥冊嶇巈購岠崂嵘嵽嶜岖岈峫峣典觍覥敟輁戝巏輙邖郥崡貤輒屷嶐擊墼繫蟿礊罊轚檕岌岥貱岋峅岜輟贂嵾輽軽峄禸贻貽軩輮峻賐巁軛軷豐酆艷贆豔豓豒轊贿賬峟賄赈岸賑崖崕峚岵軲嵗嵅輱轗崴岯巎央崦凮岩盎颛輭峏輀耑輋剬顓遄歂崸贓峸炭鸯鴦屵崎輢嶏轣嶛嶚轑嶥嶡峽輳賰嵁轃嵟賎軑軚髒嶾骮骳髓骷顝骻髄崩轁輣剻骽骨骭岄嵈骬岨髐骾髗骴嶼髁髃峼髑髏體軞髎髅髍髋髂髕髌髖髉鹘巑骲輗鶻骶骺屴髀骵髆骼骿骹髊髈崢骩骫骰骱骪嵠骸嶽髇骯畁賳轒嶻邮岐転冉冄冃由嶿轜頔胄冑峙亗崶嶀甹巅軒屽巔嵮赌賭周郮轅彫翢鵰週雕贖嶹迪廸崁貦岏财財赎轌崚轖輘贱峔岍崋賦赋軘輊峌輤豳嶳崝轉軖赇賕峘峺輻戙同峿迵輛輌嶆屿屼軏崃嶢嶤峢峛峡岼軯輕崨輺鑋峓幪帴幙幊幉幭帔帊幓軙帱帳帪輫帞幁帺帗幍甴幬帾幩幅円峠帻幘帓帧帏帖幀帩幥帽幔幌幜幱幆贴貼巾巘巚岾幝幧帜帼巇幗轤贝幈幄幃冂冎黽幡幮幞帎帵幏幰幎峴幨帕幠帙帄幖帐幯帲轞幒幢幟帡幛帨帹帆帿帢帉帷巌峭輎埊輄巀崉贘汖軣嵴嵵崼則则赗賵輼嵎赐嵑輵賜崵輰輠岿崐輥崑旤輯嶯咼冋軎剮崿賗嵓贃巖巗迥過贶貺軦岲歄軹毄嶉崮崓顗獃嵔豈嶧轘岬敱嶵覬剴轠崽崭敳嶁凱颽轀嶩賟岟輲軮岫軸峀赒輖賙删册峒峝甖屾軕岀崱嵦山轟赑贔巊轋岘鑍鸎岗嶃嶄罂罌贁崗輞婴嬰鸚鹦軜賏譻岷輾崛岂轏崫崌軐嶎嵋剀觊屺軋乢嶈嶍囘凯轇賿嵺赆赃賍賘轛嶓轓軶赕賧嶗巆嶸嶙轔嶫嶪贌轐嵝嵻嵣轆崆轄峵崇賩輐贮輨連辿賱貯賝峖嵱岮岤軝崏嵥岻軧貾见觃岇购赡贍峞峗嶦崅輡嶰崟崯峋賯刿岣嶑軥輓巉軳翙嶋嶌鵙嵨嵚嶔岉峁岁峩峥嵧軟峨輷嵕嵏贩販岅軱崤磛塹崥輴岶崲岴斬岓覱冈罓暫刚蹔慙嵬鏨网羀槧軼嶊轢嶘嵿赙賻輏嵖贉崬崠岢軻崊崾崧崍輔峬嵀账峰峯峤轎嶠岆軠崻崜貹輧岞岝嵲峲輹赂賂輅峉峈賉嶶屹贬貶嵊嵙軤峂輈巍崣嵂嵸嵷敗败內賆軿嵃岦嵯嵳嵄嶬轙巙巄巃贚嶂峷赔賠赠贈嶒剛岡崹嵭較峧賋輶崷嶟嵜﨑嵼赚賺嵰賹巕嵫罔峍贐轈岹岧輑峮軺輜崰軌屶峎屻岃軔繋嵡撃軗輸嵛崳軫赊賒軵峑輇峜峳内崄嵐岕冏峇峆嶖嶮嶝輪崘崙岑巋岒軡嶭賶嵢岭嶺岺軨岚賖岎肉峪輍崔酅巂嶲嶣嶕軓岰軪巓岪嵹嶷嵶轡幽雘崞轍丹彤訔軴輬刐峕嵩巐嵪赅賅輆峐嵉鴅崺崀崪崒賥貥牋恜悈愜展惬羾恇戼惜羿异敯慔昬愺刡蟁愝慬懄惐愅慪懵懜懱慲愥愩屉怈怇牒惵牃屟懞憯憽鴖怄懂睯暋愍敃民殿臀壂臋怴慌戕懽恾孱懾慑憜聼邔屈鶌忚屙憨饏敢翍怶忣慘惙惨悀愑怪怿忬糹慅怡憰恈幺悛发惰墯翇恹居懳懮屒悵恗憾怙怀恠怌慽剧懨愐怖愞頨忧恢鶋慡憭翜愖悏狀忕忲懚毣屘恊愶慆屗怚愋懙悎慥懓愮忇尾慀愤懴弉憤悖屆层恸厾怯忮翄忶丑懦奘恃壯慎忓慰屚叞褽尉螱熨犚怽屠蝨鷵卂懛恄牘憉懥憘懤焋懗迅怃銺忨鳵牍导悻娤牆懎恅愭忖裝那忳屋恎剭刁彐悿情慱忹怔卐恒悟丮愊怲慒憓屍憢慠怦悽愫恆恞憈郿収慳叏眉屝爿悱胥懅遐叚卍懼戄疋蛋疍悼丩怗鹛覑悓鶥疎收懢惧疏屑悄恍尿氹憆戃屬劚斸惝犀悩遲懪悭憪悍悝怛惿翨丱愰愠慢惕愒愓惈惺惃憬憫韡韝韛韚韘韤郼孠悒韖司韔韍悁韜吢韥悜悮韢韎忡翀覗韒韋韠韞愕懆憚韣愦屌憒愪悞違韗怳韟韌怾韐韕翼慖屇乪愄懌怬懁恛愢惭悃屢慺慍愣憹惴怏愲惆届怞恫刷屓屃恻惻愷屭恺慩翴慚惘慛選惽怋巽忸己巳巺书局愇乙乛乚忆忋繠已橤惢鵋慴怭屫忌乜快憀怩懭悷惦屎憣牑惼惔憦憐牖懡戂屡慵牗牅慷悾屪迉悰愃悺屄慏恽翚翬惲懧忱惋愘愹忯惛怟獎奬恑憺懈惂墏鸤惍漿恌恂惸螿怐翑悗愌怉翵鳲恀惚恟牎愡醬槳懰忺將翪忷惾版悕恡牌習翫惶怕忻斨憮忾愾愧惞懫憿怢飁翐牔慓愽恓忊杘憛懒牁懶悚憟憷慄惏牀悑怵怅屜屧悸邲恬憍尸忏屐牐忤性慟屛屣怍覕必虱悧慯愎属恪恤牕憁屨懊恦忔屦愀鴓憡履屩悔攺改屏恲惓孹买习礕臂壁翌懩璧翋羼牂遅甓辟牉怑慻飞憧愔慞憶悦屖憎惮層躄幦羽憵糪避遟牓鐾鸊鷿擘恔檗飛愱飝劈嬖翣慊悌鼊繴懻悯襞譬慨憳怓翆忰妝妀怊牊舝惱忉尻恨怆忪慃恱愉戮鄝勠牏剹顟鷚鹨翏雡憏恮夬乆忦刔悅恰憸懀憕惀忴翭惗愴牄怜鴂悇恘凥翂懺惟戳愯翟懏憔鸐忛怮憴愼怫恉惯慣迡懝愵尼屁悂惤惇悙憞懷忭惊尺乄翞憱昼懠咫懹悋懔懐憻懍翯忙怺心迟恼尽悢翠悴忼以怰慉忟忄烒度剫糤煤粓灴燁糒熯炼灷糢庴焟爡燤廑啔煂熰庿席鄺煐煹懬廣熿焫熕炬糚粔煠庹遮庶鷓鹧烵廗糣熸燪烧庌爤糷肈粪烘爑烡庻糀粠爟廰廳籽邝邺邩炪灺炀廕鬯烃糝糁熥释広糔炲序燏粑糅煣焌糲爄炦類糊煳烠粻煃粝煘廈炐炋庆戾戻庵糎粨炻糆烦煗粫糥煩頪庬烣爏燎类緳廝糂煁燍粸庞粏燬粰烰肩顅熖熁焩燲粗煖廋糙焅爝粍廫燰烍鵳熎庾焼燌庨庋熆廅庄糯燸庤烓烤灶籵廟爧廚糦熺煵懟燽焃爀庑燵燯廧庱粩籿對庒炖庉庢业精烼炡粳烜焐煏糟炳廌廲燒粀粖廒烴燦熞爘扉炜爠焯粘店扂炶爐廬爈烥粯爁糮爦庛黻应焇熦糛爣廠黼炒粆黹黺爆爗熚熶燗焨焊鄽廛粴糧炟煶灲熀焻爞熳煴庽燜爓焬煬糃爛粿煋焺煜燳熌焜燘烛燝扈启焆燥焒煰燀熉炾啟炽糞熼廙鄱烟煾煨煟勫番釋畨燡爅糬畑糫糰炠庘库翻飜燭鷭焑熡廔熅粬燶騗煓炴釉庙粙烔粡甂灿籼帍廁熴扁庫扃炯煱廤粣廮翩遍鶣焵焹烱熣烿煀废扇炄粈籸廜糈煆煝応糏爥煒焗戺慶焈断熠悉熤廦戹炔廖熮燿烬釈粎熫爌郯糭顃庐粧烾煔敥覢剡熩燔煸糄煽火飊燚扊燊焱歘爃鶑燐欻炉粐炎爜燫糖糠煻焿麊熝爊廘炏顲焢爎勞膋憥粽塋禜烷煊糘甇瑩覮滎迷螢熐營熍嵤煇煢熒廀鶯焥鎣犖罃榮醟檾烢嫈熔焭縈焪炨謍褮鄰底粼甐粦焝翷亃遴斴灮燃焰廨焔烑庣焕煥炮庖粷廯鳸熓煼扅廞粅熘廇炊灼糉炍粄烯庳庪粺焷蠯螷煌粕炘庍廡熂焮廆燩爍廏廐黀磨麾煙塺熛黂糐煿粞庮灯廂靡劘爢烞庯床燂庁炣麿煉糜摩魔爩犘麻麽穈黁庲麼縻烳炑炢籷灹粚炧庅烽燆熢庭粁烶燻煄廭爋烆炸糗糌熄烻晵烙啓烅熜燠扄炿烁籺煍熪棨烀庝烐炵肇綮烸敉秌炇釆熾庰烂烪燧糋煫料鄴凿叢炓業丵戽鸈糳鑿菐糕粒烊庠燨爔龐爖燱燑糡焙廍熷熵焖烄煪燇廉劆熑糍焍燖庸鄘鷛娄粋熽籹肁煡唐鄌燼鶶康粶炤廱爉煺数灱庚廄赓賡鶊鹒籾炝炈焧庺炂煅膺腐烩府焤廃烇庂炌庎煈粭噟烚爚熻燈燴糩廥應籶糇焓焾庈熗炩鹰鷹庥庩烌粉座焀烨炛廢雇譍焳顧燋鄜麒麎麙廎庼麆麑塵麢麠粌颣纇炥糨麌麣麕麚麋麟麃麤鏖麅麝麜麇彂麘麔麞糑庀麏麂庇麛粃煯麀鹿麈麖麡麐麍廓焞燉焴房扆庡炷广炞爙廪燷燣廩熇燺户烗煷米粮廊烺炕粹焠粇焲炫炆灬裓祴襼空禖窍寬寛寞冪褗窢襪宽褠襺襔袣褋鵼穿襽窃褡襵冣字祁袦窋衪祂窷窿礽被衱裰窡襂褬祃窓禡梥宻褦衩袏禲宏翝祓袚襫褥宥宸寡裖祳祷袴祜袸袹裺割害宕祐袥祏豁鶷憲寕袻窚宬鶟寄裿突宊寮竂禊褉窫祺禥実裌褀宠宒竁肎祖宜褑禐冝袓襷农窖祰竄寪宪襸禶寫冩穷窰寀衫襶窙宯祛袪衼襦冡褂窐袿窾社罕禃衦窴禛寘宗賨崈鶎祙褚禇宑穽竃袺褤祮襭禧竇襩禱冠完寇冦鵍窛宼守窦褹窥窺裬祾衭竈衬窀室窒祬祆裱寈家冢宇衧穻定賓顮顁竀宣翧福富褔冨裋寅戭褿窉襀裲写寭襹寳襓寶寚袜褄寁襧禰宝裭宦宧裶褃窅祉裃祎袆寂窧袩祯寊禎官悹逭視襤鼏补宵窪窏襠褝襒裆寖襮襅襊幂襉裡袒衵裫寔褆禔禵审神襇裮褞寓禑褟禢褐襡裼禓裸窠祼褴冥鄍覭鼆宴裩窤裐裎祦宺衶祌宫窜襙襌禪祸窝祝宲宮禩皲郓襬裀祻襗寰军禗禤裢裍祵褸窶寠禝禮襛禯鄆皸褍寷顐宙袖袡衻裯禂帘軍冚禍窩運褳视鶤衲袇窟穵袯裾甯寐祤寤窹寎祠褘禕寧寜寍鸋賔祀礼襈褶密寗蜜寱宓祕袐寢袂寥廴寣褯叜禷襨竊裤審襎覾褊褲窸裧宩冞灾窲襆褛窭禟裈禈褌之衴褣袉袕衹祗祇袛宛邥剜惌鵷鹓祪襜窞窎瓭祢沊窕宨祧冤襐袧寃寏袍窇鴪窵鸩鴆袳裪祹窌穸袀冘礿窳寙窊裨禆宾袙祈褫禠袾祩牢窂竆窑竅裑袟祑窮冟褼褾禋禣宁禫袔襰襋襻襟冧宋罙穼補宅袶袘袄穾宎祅祣衽祍褈裄窄襣祚褷袮複客額袼额愙窗裇窻襖窆宷裷实邃襚禭祥窯褨禚袢寵竉襱宰窨裥裞祱禅褅禘窔襯禉襴襕寴宍寝褙禙祶禌襑鞌究宄頞安禄窼裙窘宭袽袑祒褪祲鴳案初裉冗宂寋骞鶱騫衳祋宿袱窬褕袗塞察袝祔窱裣衸祄容彮袷祫禴褓襝蹇襘禬赛賽衿襥袊鴧搴寨袵宱寒穴衯寑裕襳弿襏鹤褰謇隺寉寯鶴襍穹宆它宖窈袎褖禒宐祿襁實迱窽寲禨裗宔禳襢禞冖辶礻衤褵祊窣祽袨宀錢鐷鉽锘鑶鍩頯鏾钳鉗鐯氒鑉釭鏵桀舛銾鑮昏錯镆鏌错钄钷鏂鑎鉕锚錨鑖锳鍈鉔帋鐄鏋钜鉅鉪鍱铽鋱铹鐕銰铙铘鋣鑝釾氏鍣鹱镬鑊鎝匒錵鉷钺鉞邸鈛鑵氐铓鋩鴟鸱錺釴鑷鎁镊駌鋷铒鉺釨钌釕邜夘卬眢鐊锰盌錳鈯怨釶夗銸迎鸳鴛钖锕錒釢妴铍鈹钑鈒色錣鏒鎟銿铎勾鈶鐍钯鈀鎷鈗鉾鍒鋑钗釵危頠鈪钹鈸鈜鏏铕鎒鍸銪鋹鋠铸锛錛鍷錼銙鋳钴鈷鍼銊钚銌銔鉟鏚鈈銇銆匎鉐钸鈽顉铖鋮然鋴厃鏯锜錡矦镣鐐镢鐝锲鍥詹甔鍖鐁鋏錤銭钛鈦釱觨觾觵鋢觙觭錋觬觔锊臽觟觰鋝钥鈅锾鍰锄鋤鉏觩锼鎪觥觘触角觛锆鋯鉫觶觸觿觽觖觓燄鑀铣鑽銑觗觤鹐鵮鵤觼欿觝觚鎐觻觫钐釤釛觡觞觴斛觧觪觯觲解鋖觮蟹邂觹鐵鐡鐼鋍﨧鉣鎑鈘勻鑐銈铐钍釷錴銬针針釬镇鎮銢锗鍺銡鎱镭鐳鑟釫鑄鋕鈨釮鐽﨨鈇鐟鑚錂铑鎍銠钱鲽鳠鳓钘鈃銒铏鉶錻钝鲰印鈍鲏鲐鲬鲹铚銍鳋鲃鸟鲔鲕鳡鳜鲯鱿鲅锖錶錆鳐鲵鱼鲑錏釪鳍鲒鲼鲓鐚鲮鳕鏄鲭鲀鲆錱鲾鲠鲡钙鈣鲱钲鉦鲇鲈鲿銶鲁鳗鲤鲣鲥鳀鲳鳁鐂鳎鲲鳄铻鋙鑩匐鍢镉鎘鳃鲴鳂鋀鳏鲢鲷鲉鲗鏪鲖鳢鈵鲺鳚鱾鳛鏸鳞鋄铔鳙鳊錽铼鲩鲍鐃鳇鲌鳈鲘鳔鲄稣鲊鲧鳤鳅鲦鳆鲜铗鳟鳉匉鳝鲛鳒鳑鲫鋞鲟鲪鲻鱽鲶鲙鲋鑈銕鲸鳣鲚鲂钰鈺鏬鎼錿鈙鏗鑦鐬錹鐻钼鉬钁鑺鉲亇鋽钻鉆夞鑢钀鐪鑪鏀鍞鈻迯鋧鑑鑬鐤鑡钋釙外铴頫销銷鼗鍅玺銧銂覜覙兆錔鐋镗鏜鏛鐺钂鑜镋鎲鐣鏿锁鋿鎖逃迩鴵鎃钞鈔淾尔铛釥鑤鏎郇铿旬鐗锂鋰銲钽鈤鍆鐦锝鍀鉭鍉钊釗鉮鎤锠錩鐧亀镘鏝鎾鍝龟鎉迿锡銞鍻錫鍚锞鑭錁鍟锟錕鉵鐛免鍓邭句象勉勨鋗劬名锃釦鋘鋥钟鈡钏釧鑓铝鋁鋛锷鍔鐰锅铞銱鐀够鸲鴝鵵欨斪鉂敂鉙雊劖酁毚兔逸锢錮甸铟銦鍡鐸钿鈿镮鐶鎠钾鉀鑘鑸锶鍶链锣鐲镯鏴鏤鎅镙鏍鑼鋜錪奂錌鍴鉠镚鏰铀鈾錭铜銅铡鍘岛島鍋鐹鎧銏銟铠錷鏈钢鏩鎽負鋼负钠奐鑴烉夐敻鈉鏙钡鋇鈱鍲饣锯鋸钮鈕乌邬镅鍜鎇钃刨鍏鉰钆钇釔釓釲锔鋦鐉炰鏘铋鉍鐴包镠鏐鈌鑃铌鈮鈊鉯鈬镀鍍鸌鱯鰳魽魟鰸鰙鮔鏣鰈鰋鱑鑛鱹鱴鮍鯫鄔鄥鯭鮿鑁魥鯒鯵鰺魣鰠鮐鱊鷌鰢鰇鵔鮻鉱魷鮪鰗鰖鮕魾爒鰆鰔鮖鱱鮞鱤鮬鯎鰄鶀鱖鯕鮁錑鯢鰀鱮鯌鰩魹鶃鳨鱫鮾鰭魼鮭鯥鯐鮇鯺鮚鱚鱩鰪鱬鱝鮳魭鯪鱈鮱鑆鱷魨鯖鱄鮃魳鯄鰽鯃鰏鰿鱁鱙鯁鮧鱺魱鰬鯡鰹鱥鮛鮎鱸鱋鯱鳥烏灳匊鮹鯋鱨魦魯鵿鰻鯉鰣鯷魝鸔鱪鯧鰛鰅鰨鰑鯣鯹鯤鰐鱓鱢鰃鯝鱞鐇魻鰥鱰鮰鰮鰓鮂鯛鱡鮋鍽鰂鮦鱧鰱鰴魶鮙鰕鯴魢鳦魸鱂鰼鮅鴃鏭锬鱗鱅鱇鱕鯿魲錟鯳鴕鰘鐒鰚鰰鯮鰫鯶鯇魫鑅鮟鮀鴥鮑鮣鮠鱌鏻鮡鮈鮸鰡鷠鵴鰞鱻魩歍魡鮊魬鰉鯑鰁鮢鯯鮜鱳鯓鯼鷈魺鯂鰾鱏鯻鯟鴚鰊鯠鯆鈩魠鯚鮓鮏鯀鯏鴼鱎鯦鱵鮥鰍鯅鰒鴤鮗鯘穌魞魚鮫炙鮩鱒鱃鮮鱛鱆鱔鸃鮵鰌鮷镰鐮鯜鰜鱶镤鏷鰦鰟镂鯽鮼鱘镛鯞鏞鵦鏮鱐鮶鮉鎕鯔鱲鰎魛魜鴏鮘鳧鱍鯸鮲鮒鶳鰤鰶鱠魪鮯鯩鯰魿鯾鮽鮴鵌鰷魵魤鵻镳麁鱜鱦鮨鮄鏕鑣鰯魮钬鈥銤鯙鱣鯨鱭鰝鯍魴鷻鯲魧鮌魰鑧鎋鋐鎺邊鑹錝鋎锭镓鎵鍹錠鑌夤鏔錧镩鍕鑏鈂鋺镔铵銨镕镲鑔鏥鎔鑳鸵铊鉈錉銽皺鄒卶钩铯銫鈎錎夡鹅鍂镥铫匇銚鉨銁铭銘鐌鉤鋔镵鑱钨翗铇鉋鵝鵞鑥鎢鵭迻鑫夠金鶵鉹锪芻鋾鍃鍯铆鉚钧鈞多憌铮郺錚镏鎦钦欽雛钓锇鋨釣釸鍧匈胷鍐钣鈑鈲勿甮锧鍎錍铂鉑锽鍠鋲鈝釿釽铢匁銖刎曶銗匔锦錦匋遙忽鎎锨鍁鑕铩鎩銵铁鉄鑠匆怱鄡镖鏢镈鎛钵鉢釘钉匍镡鐔錬钶鈳鎶鏉鋉鍊錰鑻枭梟錸铺鋪鈢鉥锈卯鉇乮銹锋铦銛鋒鑙鐈懖鏠鉃锤铥銩锸鍤錘鈓钎釺铤鋌鍾鉎夝锺钅鑂镍鈼鎴鋋鎳鋓鏫鍑铬鉻鎞鏓銄鐭鉓鎫夕儿铄勹釳锹鍬鑗鏼鉖卿錗鋵鏦鋂鉌釞釒鉼锩鎙錈匀鎹鎆鐩钭鈄斘錓镁鉝锎鎈鎂鐥锌鋅鉡鑨镜鐘锏鏱镱鐿鏡锐锫錇鋭鏳镝鏑钔镨鐠镑鍗鎊锵铰鉸镧鐏铲鏟鎌镒鎰锑镃鉳銻鎡鐞皱邹刍鏽键钕釹銉鍿鍵斵争録鏁铷銣鉊留锱錙镴鑞鶹遛鹠贸鄮貿鎻急釚锓鋟劉煞釖勼雏匓銀釻银釼釰凫鳬鈠鎓鈆锻鍛鉁鍮鉜铨銓鍨鎀鏅勽鉩铅鉛鑰匌铪鉿銳镎鎿鐱镫鐙錀钤釠鍭鋡鈐錜鎚匃鎗铃鈴銝銋欠飧鈖锉銼鑯鋊铧鏺鈋锥釟镌鎸鎨錐鐫鐎鏶钒釩胤鐑鎭鈏鈟錄銯镄鉘鐨镪鏹鏆匂锴鈚鍇鐖鉧镦錞鐓铳錥锍鋶銃訇铱袅裊锿鎄銥鉒勺久鍄鑇镶鑲镐铈鈰鎬釯匄灸粂卵钫鈁孵鍦毈镞鏃镟鏇贕邎锒鎯鋃钪錊鈧铉鏲鉉鈫拭擛皂搑掿撒擆拑扛皣撶攤擹拣擓摸措擖揠躽軀掝摳描摃搆撗拒抴揲捞摕撍擏躯抠挠捓拱擭攃搭搽找揶攝摄掫报撱挕邤拯摂凶掹拙扡兇扬挅躱扔搎卮披扱拚掇摻撡搡掺撪捅择瓥抒瓜反搔掻抬把皅返抁瓟瓝瓞揉挨巵摊捘払扠扼挷敎拔郄抜肴擾郩殽搙躼掁振拜捹摦捱拝捺皋撦挎翱鷎撼搣揻抷拵摵抔揼掩擫拓希郗瓻抪鵗欷颀頎扰拋拻挞摤掎躸攊撩撅揳捧挾揍摏軅揕撕搸掑拢揑捊撬搚拹搯掤捋揺援抈抯搜拥覛攑皓捁拁皭撝授攪皧攒攢掜摇採扐劰劧劤掙挼擮郫挬技搕抾抎擩挂掛摴持拷扗盾扞攧鶞遁搷瞂抺卑皁撠擀拮擡撷擷擂撎质擜揇乕貭逓抟軇擣扝捇挝抚鹎抏鵯撻扶撵攆攅摫掕攉皬搘射挵邱扽挃捯丘掭掅皘皇掗扜摶抂扌捄皝挭皩捂攮揊搹岳抦掚皟扤屔攦挜搢遑撓皢挒扙抹皌乒挟抨捷挳捿擟兵挗乓掳摢摣摅鷉遞虒歋卸爬摼排據掯年看坕鵇扯挊攫捗拤爪掓掉牛拈擄攎攄揁挋挸爮欫攬皉扑邾捎毮挘皐翶挄撹朱挱撑摚擋攩撐躺搅鴸灥楽撇抄泉挡鼄撮撊擝捏捚捍皔担捫抇撋提刈抻捜揾摱搨捑揭掦掲揚躶攔捰揽擱拽掍撔揖郈擑挹后捐捌拐劶吿垕扣挰操躳捛撣軃损損撌逅拀抧摑擺摁揋擇畠摆掴擐押攂攌揌無鄦甒鷡舞擉斶捆橆撂摟擻搵摞攞捉缸擃軆捵罐缷揣抰搰抽抩搟皗挏缻帛捙製罅緜制罏掣罉罎缶撾皚撄罁攖缺皑缹摙罀缼摲缿罈缽缾罇掆摧攜抐皠罆抿搌气掘氖撖拨氢据戶氪捤扭扟握氫氬挧挪氰搄氩氞揯揟摨氘氜氠刏氲氱氚氤氳氙氝扎癿扸挶忥撰氣氮氨摪摺所乺気氥氭氕氡氧摒擗搱氯抉摎氛擢氟紥抳拟抋氦択摭擴拡捩掮掂播皤揙搧掞撈軂攚撛掋擵攠护扩撲擈搂軁躿搪擞掶捬軈攗摝皫攟攈控躻迫廹搳攇揬攛皖捖揎掟擯軉捾撺近挥揮挖擰躭捥抌摈攨搲探拧挓搾揢按擦攐摍搈攓抭摉搉拕抵魊捪扺搩魆抑皃鬼抅魃擔撚魌掐鬽捔魅鬾撸捦魉魎魖挑魈魓挽拘搀攙捣換换搗魍抱兜掬擼躹摀鵢揿搊撳拸掏搖鬿揔魒魁抣魐挣欣魀魋扻魕魑皒揈扚的扳鋬皈皞硩爼挀捭埑揗拍揘拞捳捠抓斦抙折搋擨皡蜇晢哲啠踅撫質劕悊乴焎烲逝魄銴掀白皨皛掱犇梊摋皦撽爻娎抶皪擽拆裚誓弑搏摽拪躰打刹揸撢閷捒抲揦攋摗揀拺搮杀殺捕弒剎托抍扥拖逰括捀挢撟摓擌扷挺插捶扦揷挿手揰攥擤搝拃皥揝挻摥挌摠擙扢揪邀抸鸄斤搬擶捼擳躷拠摐撘挴敫敀譥乂扖拼皏軄搠捲拦掷揃抖攁搓拉躾撯拌攏撞揞摬掊搃捝掸摘擿扪掽搒揥皎搼挍撙擲揂搁摌接搛搤揹兠挮摡撏揤势抛垫挦扫揵捸蛰摷招捃擸贽殷扏慇热掃鸷拶挚絷执拫躵扨抢投捴捨揄抮劮拊摖拴揆捡失扴拾揜掵挩搿撿撜掄捻搇扲搥怣搶拎迭皊鴩躲捈挆拰扵摿扮掰躮挫攕抡撥推扒携擒勧擕撨観歓旣墍曁槩卽皀皍拗攭掾指拂摾掼摜躬抝撧樂擬搦批揩拇撴撤挔攍拄抃斥掠挤擠攘擅搞皜揨摛攡揓躴抗捽掖摔搐撁擁抆械櫙桺棧栻栉榵桏欌楛楉橵柑杢楳樲杠樺框橫榧栋欂模橗棤椻槿櫃覇棫樞覉覊櫗横構楧櫣槓樠柜枻楪檬柩橬槆檧枢桡樥枒欗櫹栱檴欍﨓櫒榙檋櫵椛權欟杙椰欇楹棷椭橢櫇李栮杍郙邒極檉柮杝杨桗樄槂极柀槮棳槡椮桳桶樋树柽杩杼枱橘杷榪櫲桙懋壄楙楺柕梭杈权楕檶櫔梆枙柭櫘槥枥槈楜栯櫌棖桭櫉槬楏桍梼枯橱椷楲杯栫柸槭桮榎栢柘槗頂栭柨顶遷榞樉椅櫪橛橭橑楔棋楱樁樭棒櫀椿椹榛梜栊桟枤杕檼檓桴棴棚橇栛槄桕枂楥査柤櫸欅枷梏枆梑橓棿欑榣櫾棌杉朸橳桵楰榽枿欛橨鄄桲枝榼枟檽桂垔橒樗杜栲甄植杆槙票飄瓢彯勡隸剽顠翲飘柰歀柡标楮橶榸檊枾桔檯榬櫺欞樹檑橲櫝楠杇檮梽杬歅材椟尃樯橽樰槸棱檣櫕槻枎栈榰栳村醋醆酣醛梇枅醧醼酏杶酸醊醦桎椡酉醃本醐酭酤醎醢酞酷酻醙酹釂棈酕酰椓酵酝醻椏酐杅醏醽醘醹酛酜酎槫枉酑醩酽釃酾丁醵柾酟朩酬梂醒醍桓醖橊樮梗醌梧欜酲櫮楅槅釅醞醳橿梪槽醲杮酮醴醠柄樍配杌醑醪翉朽酦橞醚釄桠醿榗醣醾醈醭欐梾酡逎醡酧醓酖酌栵酩醄橈杤杖酗醜酊醥醰酠醂酺枺酥酢酪醺酶枰醝醸酙醅醷棲桱酔醁酚醱酘酫醮醗檷酴醶醀酯酳枑榡桋醉醇醨釀醕酼醯酿樾樝椃榩樫棑檅杫相桛欋欔椒棹槕枮櫖櫨樐桢楨想栌栕梘欖檻檙椇橴朴梢桄栦桫檔樘欓橖橕杪档桜樑榉﨔樶橌杳榯梩桿椚皶棏查柦棩橍柛東榥覃椙橺橸螙櫚榅槾榻鶇櫩楬鷣楊鸉棵欄槛櫊榄棍栧楫檝可頼柺梋鶒勅杏枵桯杊束剌揧榀梠梙楍槵橾欕樿樻速赖賴柷鵣遬欶哥歌戨整慗鷘遫敕辢枴枳喸槶栶棝椳盙檡檈柶檲椢柙檌柬櫑欙楒梿椤鶫梱棞樓櫢楐榲樏欏楞柵椣檂欁柍椯榾柚柟枏椆梬桐杣朿刺楇檛榿樱栅櫻桤槤枧棘棗僰敇枣賈贾棡棢枘欈梣梤槯梖枬榐橄朰乶樼椐梶杻橻梉栩梛楃楣椵楈朻榍欘樨蚻椲柌杞札梮梞槢柲榓檘榌櫂樛柅紮杺樜櫎棙桩櫥槴橎楄櫦棪橯橩櫿檆橉枦榳粟杰欉檏樸楼槦槺榶椩椨櫠樚椖椌迺廼槣櫶椬棕梡楦榁榢椗檳棺逋榠榊楎檸橣櫁樒枕椀槟柠棎榨楁榟桉榕檫樎榷柁柼柢桝棔桰榤枊桞栁构栬桅橪檐桷槲檞橹桃栒橡枸梚欃槝枹椈櫓櫯鵏樢栘楤柳櫋枃榴棦橮檭杴杓杦栀椶板梔柧槔桸榭椑楯柏楻栃梹杽析榹枛株槹檪楾晳蜤橅棉鬱惁槐櫆攀樊鬰皙欝欎蠜礬櫍燓鐢棥椞樧榝檄覈橷柣権槪梎櫟柝郴樷櫏辳彬禁埜標檦榑栖梄梺槱朾楂橝棟柯楋櫴樕梀楝榃槚檟栜楚焚麓椘棾梦鷅森檚木栗婪楆梵檒棽棼棶林枨枡栙梍杔麬柂麰桥麵栝桻橋椥槰檱枖杵麮棰杄櫡梃麩麪栍麫櫄桁柞橰梴麲麨椼楿梸椱格楀桖樬麯麷栴栎杚柹楸柉覂麭橁麴麱麳覆麧麥櫤柊櫛棅樅梅櫷枚柇麶樦杁栟樴棬栏栚楌椾檖椦枓樣柆槎样様橏榚檥檨梓柈栤櫳樟橦檍槞樈榈棓棁椫橧樀椪榜楴檤栨校榇樽橂楢櫬槉椄槏榏梯概樳櫭楖要枠橚桪楗棣椂樔柖桾椔朹棂梫桚覅朷榋根梕杒栰枪松棇枩杸椴覄栿榆楡桧柎栓楑枍楩樤樇检厀桼楓檢椧柗梲椺検橙檜櫈棆槌机桘梒枔棯槍柃枫梌栣枌椕來郲猌勑桽櫼顂賚憗憖愸鶆逨枞桦橃梻杹椎榫朳朲槜檎欆檇樵杋椽欚柪槇栺柫樌杛朼檵檰榒機橼櫞梐枇楷栂椁槨梈橔梳棛橀櫰槠堏櫧柱榱椋朮术櫅欀檀檩檁柿槁核栐杧怸怷述檺鶐楟橠旉樆敷枋椸檹懯榔樃桹杭椊棜棭槒箋筇穁笻箬篋馓笁篏筐箧筺犕篚夅逄乗馍稓徣升笸簕馑稢籄稶筪簧篝篢穔笹秬衐徔簪饶笌彻乇筑築穫籆簭遾篫衖筮长牫竾箃頺季饵秄篜饳笜牠彵透迤饧秀箛篨彼秛笈彶径笲笆篸穇犙筩笃饴笞秮篤么馂稄私甜矱犡矩憇榘秡叐舌頢篲箶衚筹圱短牯秙舔箴秠籍夭筙乔刮夆刋舓智喬聟敽勪呑知鷮敿鼅矲岙稬舑乱舏稽嵇嵆筬諬牻舕适逢蠭舐鸹鴁鴰鴙舚犄徛敌矮矯矨舙矫憩矪辞矢簝矰稧雉簸矬簊箺谸簛箕筴稘笼矧穩稃笔箙筟筋稻稝租筯笡徂馊稲穥籅笳甪筶牿簉穱稱牦秏笾筅籫穳务竻簲徭牞籐籘馁箏穏徯垂郵籖甀饽丢馌篕秓秐壬穤歃敮臿特竺玍篈筀徍街等待秲牡稑啎徒稙犆徝秆竿憄衎衠稹午箸簳千籉秸穯德犢徳毛籌忎迁廷迕颋頲筠笎衏簙乖犊埀穑稜穡簮籱籗笺饯笄剰筭筓饨秷箌牜生甁幷逬箐篴竽稏篿彺征徰惩篶重動濌憅勲筻稉衙馕牾稫熏勳饾積箦簀穗穂徕籭穲穘徺行鴴鸻秣秤徑牼箑徢籋穪算簴箎郋臭穢自鄓篹篡簒徘纂籑犑籧怎乍眚迮片臰徙籰衢徏忂处臯翺鷱篎昝咎笘秥鼻齆齅齉齈齄齇齀鼿鼾鼼齂劓齁籚齃鼽息鄎臫熈延郔蜑邉臱筧臬臲甈鷍竹籃辠犋臮篊笵筂箥箈稍筲箾箲衍愆箵簜篞簹徜籓箔簿秒徶尓筜簗馢篳犦穝忁馛馣馟香稈馞筸馩笪得筛徥利馡簡馧馤馒馝悡馜馪鋫犁梨稞馃复篂馫篮馥馦馠馚馄箟蚀簢箿頟各程和筽徎种洜稆筥簞馈鄅禹篑簣篔筼惒鵅兎敋积雒箅簂簚穓衊衈卹笝犤血箇筃甶稒秵衃篾甥稩备睾笽盉牭衆笚徊簤惫衄粤粵箩欰囟衇顖恖囪稇囱箘衉簬悤稛衅簍衂邍籔稷籮筁穠範秧篅身馉笛簓秞牰稠徟筒衕秱懲徵徴币秈屲向逈簻黴笧幑奥奧嶴秽笕簐簵筫犅微笍箆徽徾笢乞箼篃徦犌稰乐穉徲刉饲笥稦徫躛躗衛衞讏讆筷馔簨迄簰秘簈箳稺籊穋秜笖穬甃湬稥蝵簄篇犏徧稨愁簖簩鹙鍫鶖揫醔簾夈穙篓媝穅篖簏穮犥秋箜牸犗秾筦簆徖稼箮穦馆管箢鴔筞秺乏簶穃簺篧牴籛秖秪彽禿衡頹簷馅觕篯衔穞銜称筄徇箰筍穐馋笱饱笣穒穭鵆籩移篘犓物笏惣黎笷籦睝黧鵹鯬邌錅犂棃剓笉稳筝籙馏饮饿彴箍箝簼簎稯饭筢箨笟稀循稗箄徨篁籒御牪禦衘笊篪穆秼筘箉籜饩犔篼籀笅篺徼攵秩籡我篐簯馎籈篻徱牺徆笨箱饤馇簟籁笴牱籟簌徚簠策箣籕篥箖条徠箂秫秿術饦秅篷筈秳簥穚犞笶笑饫秗饬甧笙饪箠秊秊筳牲甡徃種箽衝筕筵笮秨簁復筣稪饹笿篦丿饰饷秭笫牬夂夊篍簃籞篽筿禾彳笗犐箻篵龝牧秝饼艧艨穣舡艜艓舼艋箞郍犈舥舦舿箭乊艀艘艁穟科笠艢乎乯艝徉犧馐艚犠衜舻秚艣艦艫犪従舟籠艄徿艡简艃穜犝徸艒螽篭税篰箁稖犃舯艥盘舺箪艛舰舳舢艉乥艍舮艔艑舵徬篣鸼艪鵃鷑艬饺舨舶艎艊艐筊舸舾籣艇艂舴簅舽艞舧冬艖艟艏艗艤艕稴舠般舱舩艭褩幋縏螌船磐鞶盤艠艌艙舲鎜搫艅槃媻舤乘剩稊舭稵航艩艈舣舫艆舷穊節蠞笯衟委簫律筆犍徤瓾覣秉箫箓笤筎簋犣簘逶箒魏笋犩籂笂秇很牣筏笩秃役垼彸颓頽符穄筌篟牷箯筱篠签黐黏黍簽答饸秴筗箚劄籲籥穨稅籢籨簦徻稐饥篩笒篌筨稔篬秢衑笭彾鵚徐筡馀稌筰秹秂処凢秎篒從慫聳籤熧稚篗穛穕竼龜篆勄毎第系彿笰牝箹籪敏繁後鳘籎緐瀪慜鰵每篛秕笓筚稭穖毓牳稕犉犜徹勶簱饻籯籝往兪簔簑笇汆入稤穧穰忀稿肏屳篙犒牤笀兦籴糴込籇鳰篱籬彷牥箷簇籏稂筤箤笐稡秔牨箊稸衒郱疘瘔頩疳瓶冮疟癱冻竎并瘼瘄戠癘阈馘瘽癀疶迸痨鵧艵疨冴剏剙瘩卷闻塑癮疓朔愬遡槊勌疲兯疗疖逆瘾欮疡屰痾癃癊痉慿瘮闯瘆痛衮冯瘙冶馮憑駦凴兖竢疤瘫竣痠郑闳竑冹闫疬痏痮兰减痞头阉竰竡痷頖疣痝送闼癧关療瘈瘛凑瘞瘱瘎凘状颜顔顡彦痭奨醤疽瘦龍前瘸痂痈翦竓癙煎遂阌遃冼鷳阋劵辦豙剪凈毅瘐痚阖攱闺痔壮癫竍闬癲阗瘨疛辛瘏阇斗癗凟痣乧疞羌羗闭凌養养鯗癨装差羢齹羟痓羓羧美闰闩羱羬靖凊羏劷豢瘃瘂羺羵癋竱羥羠症着疜羨羊癅羯半痦竵盖痘病羰羞翔恙羔痖羹羳羻羙羮羫羦羜義冽疠鲝鴹鮺羝羑羲善鄯瘗羴敾羡歚凄姜痙羚羖羭羒羷冱羛痍癍羶羕羪譱瘧痱阒眷癯竨丫闱痁站夔齤疵丬龔龏聾驡礱痟壟龒龑痧蠪鸗阔竗龖龘瘠襲冰讋贑頀韺戅鄣韷间彰癇音氃勭童疸韴判痩闽痋章奍阊癎韻瘟意竜阘鷾遧竟竭鶕鵥竸痬韵嬜歆瘍韹赣贛韸戆戇韼竷韶部问袞勏咅瓿冲剖癌郶闾癉阓总竞兑兗况競敚敨疻痹兾郸痼凅凙癦兽阛癏瘝曾单鄫曽甑朆闸痐癳冁阃瘻瘰癑痶適啇甋端敵歒凋痌帣疝瘑凒瘿癭闿商凗癜冺阚巻瘺翊瘕闷韏乵癖竮决瘳疦痆並疢普痰癆瘘道竤竩導痯凕噵帝啻瘒鶙遆竚旁覫阍痻疧疷奖癚阎觠将螀癣凎鲞浆阄竘痀凂痪瘓疱鮝癬鴗痑瘹酱桨净竫瘤资垐瓷咨盗資恣乲粢楶栥秶姿餈次疚郊叛瓣頝効痺虠拳牶痸鵁瘣效竧交兿奠鄭猷尊凐瘭鷷遵酋親闲痡凍蠤辣疔疴竒瘌癞癩瘷瘶竦凁阑遒鹇鷴新痳痲凚凓亲桊凇竔痵疾産痴产竏瘇癪首痄癟瘜凞瘪痢剷阁竬癥癓疙疺癁疼瘢痿癤痜瘲痗阙瘚癢痒竝瘥辡冸瘴瘖暜癔阅痥阐竲瘅痫竴立妾疩妆冿甉痕亷癰歉鹣鶼券兼辧阀疮疫竐疹瘉癒瘵痊阕闪瘋疥颯冾益竳蠲癐鷁鹢瘊竌瘡凔冷竛疯飒凃餋竕飡痤疭癈准痽凖癄孳弮邶瘬背鄁丠甆弟剃弚鵜递鹈辮絭勬疿冀軰慈北鹚鷀鶿凝癡辫疕兹疪訚誊六疰疒冫门凉闵凉癠凛凜癝癛闹阂痎辨瘯丷辩辯辬阆飬瘀瘁阏闶痃癴癵癕餞嫟嬺媶娀婼饊媒姏饚妅嬅嫨饃嫫孏尋鄩彠嫤饉嫗饇嬿媌媾媖嫹姖媟饛既暨塈鱀妪餀娆嬞嫕娂嬳婲孉餝娵嫷堲餌好媸即邚飿她恏婀奶孥驽娺餟駑砮努姢妈妤始飴帑胬怒妑媽鴑拏媃娭厹餕弩奴媠妭娠媷餬媩姷餦餴娾姱姑媙妦娝妚餣妬媔媆餪頄娍娏娔嫄婍嫽嫴娸媋媅嫀娐饀嫍媛飷姐嫂餿艮嬩嬹嬀嫒嬡婗饡姺媱婇婬餒娞饙彟餑妓饁妘嬬娃垦嫮奸飦嫃妹書卆晝媎妌肅鷫歗姞嬯媴嬉畵畫嬄饐劃饎嬻婻娡嬦妩妧孀嫱寻婞妋嬙婈姥妍姸娬飩姪婖衋婊婧婭嫥嫣姃姮饢聿娪婳餖姉嫧娅孋建饒嬈煭妺婕娙嬭姨嫊婋嫭虓婔饖盡賮婌婥肀媜姬姫娊媫娋姯隶肃剥鹔嫦饄饓盝逮逯妙录媣饆旭嫺旮娌娨妲婣媞妽媢娼饅媪嫚饂媀餲餳婸巢鄛勦剿孄嫻餜婐餛婫蝕邵郡卲綤邕雝君頵娟劭召叴娱如覠妕刟嬠孍嬋饋娲帬帤嬇恕娛巶娯焄迢鴽鵘欩挐桇群羣絮裠婟姻餵媦娚嫐甾嬕嬛疀嬽媤鶅邋巤媼嫘饠嫼娖姍婰姎婩媏餶娉妯姌婤姛餇嬍奾帇媧姗孆妠孈媺姄婮娓妞娜媉媚婽婿孎飼媁妃巛饌妼刀飶恳妜嫪嬥妮姒嫬粛嬏媥婒餤嬫嫾嬷孊饝嬤嫲妒災灵嬚嫝嫞餹彛彞妫辺婃嫁媗婝嬪館婠退婶彚嫇帚餫媈嬣嬸婉妉嫔姹巡廵姲嫆婚姽餡鸠姚妳餆姰饞姁姳娩嬎嬔婏媍嫓飽鳩鵖鳭婅姼媰飹夛餾婙嬼媹飲飮餓娥嬝妁奺飯餚餙婢餭媓娦妡姩姝姤嫵婂餼媿餽嬓妷嫖餺奵飣娻餷嫩妸嬾嫰娕餗媡杂婹雑婡餔奼飥妖娇姡餂嬌飫尹飭妊飪娷奷娗姓媑餠媳嬶飵妰娫餰娳餎媲飾餉姠姊九姂婑餧孂娒姀飠姘嬢餅嬂婘馗餸媊嬘饍餻嫅媄饈嫸嬟姅嫜嬑婄餢娧婵嫡嫎媂姣餃娴媨媇嫉嫌娣嬨奿姧嫿妇奻嬧娽妱婦姦脋刕女妐媮婾飻姾姵嬁刅妎姶媕餄嬆媬嬐嬒婨飢餱娢妗娰姈餘姙餁妢孅飤孇婎餩嫶餯嬵嫋妣媘饑姆娹訄媯餏妵娮丒飳飰歰刃刄丸婛孃饟嬗饘忍姟婷妨嫙娘嫏妔妶妏侙僷俴傇偌儰仝垡垈佄仜仺備傼儺借偃僅傴黛儚贷偀傋帒岱貸僙憊佢伳偞儆僃僀僭伛牮柋侥伢供袋伐代戗仓倻仔佴创怹他鸧仍佊伋傪颂頌俑瓮伃凤佁僪翁勜鶲鹟忩傌兊毤侔枀俟殳公俊傩仅仏佐伌舒伖優傉侑倀侲舍侉倴倷俦估仨仹侟伾傶俖伓俺佰佑佦偭佈偄侕优舘鵨偧傸傆倚舖做儮僚傄偰段俠俸傣偆偡僛倛伏俘鄃俷毹倗仴俇伹佣傁覦俞伽俈觎偁愈僞逾僢僾倪儹侁歈傜倸仂俀傒偾傤僨儎侾侼会郐凨刽伎佉伝儒佳侍仁仕侤值什仠癷値傎祭畲佘佅仐偖傘儓舎佶舗僖儥传儔怤俧発倖佞姇伕僣儧倰佬付倵侀伅倒侄癸戣鄈倩儬俵傳亼全俹僫伍仼佂佱傿俅便凬使儾俉倳偪僵豋侸俩倆侢伂傮债俪債兮僡俨儷俫例夙僥鳳仗傲侠伻俓倢儞仾傃侇佤俿儏俳凪企仩倶伟佧俶倬个佔儢侦偵候佀俔修倏脩絛鞗儵跾偹儖悠翛鯈焂倐鎥鋚條攸偼俱佌偨仆俏偿佥侊偗剑傥儅儻償倘僘敛仯氽尒仦儤颬颾颱颰飇飉颩颼僩俚颫們但偍颲飅飋伸颭敒颶風颵介倡僴颺僈颸偶傝飂颹飈颷偈飀颮偒倮飃颳颴飍倱儑弇命偮郃俋颌頜龛合俣侱仲敆儙侣劍儼龣偘龠龥顩侃偔鸙龤僺斂龢劎僉歛龡諐劔劒盒僤畣傊僓翕俁翖歙鸽兌鴿敓欱拿搻保堡樖盫賲煲侶龕伿剣剱鄧個偎侽登佃伵儇覴伡會鄶朇劊佪儡儽偲邆僂凳傫儸促儂僼倎佒偳傦傰倜伷俜侗仙俥凧侧侖仚側儩僆伣僌催儶侺倔今僝倨頧阜侌侴顊師偓假偦歸亾蛗含伺偉颔頷贪貪帥峊念亿侷敜僎追鳹鴭欦酓韽盦侯鄇佖僻偋雂僇伲似伈衾癶侭伬戧儣儍倉創僠偏僁傓倓僗儝鶬僯侂僕偻傭傏俯僱儦伪侎伙倥邻领領侬倧俒瓴伫傢儐倌刢翎儜鸰倇鴒傧佇俕侘令侒僒伔僿傛傕佗低傑仰尣儋佹釡尩您佻你侚像佝佲俛儳偩佨鳯侈尦偬伆伨俄仢爷爺飏爸仮倄俙飕俾偱伯凰偟釜件伒飐飓傂侏风儛飔飚爹傀飗飑俽斧儨儌父佚叙僊傅僄体価仃敍凩剁倲何畬價峹嵞恷悆僳烋途鸺僲鵂傈儊僸敘朵余厁斜偠倈倯雓休俌伥佭仛仫俬侨佸僑倁仸伤俢任恁偛偫倕仟仵赁賃鵀侹栠凭倂働偅作偺倃亻俐傷佫俰偊傻俻侐傯几仡偢僽佟侜倭傱侮係八併倦儯偐偂伞位儀傞佯僐伴儱僮偣傽億傹倍侻僧们傍偙佽佼俲傚偤僔儭仒傡凲倿傔俤偝弅邠伮颁頒坌伜健侓瓫儘蚠侰侞佋兺盆儠贫岔貧仇忿炃麄侵鳻分伊攽仞佷仭韱耸伧伇傟倊癹伀倽偷偸俎佾坐侩傺剉夎佩丛佺僜睂俭伱价偑欲慾谾卻郤谹豀豂谷佮谻豅螸谽豄鵒逧鹆豃谺儉谼倹儈倫佡怂仉僋仱傖伶俆仌份俗众侳人伦僬仈从倠儁仑倾傾华僶伄佛货貨化儗發偕仳僟隽隻俼顀依偽偯储詧隼儲鶽傠住隹信雋凡僦倞侪儕售儴儃傐侅侫焦劁顦鷦鹪停進儫燞仪禽集仿倣亽食俍伉雧雙倅犨雔雦雥讐伭傗雠伩犫讎綫縙绒絨繖绀紺紅红练縸缂緙緎彄緢绬緓彉绁紲弡弽緤繱绕纄弢緅弭鄳绌絀弛毑級紴级弪经缀綴縿縔経绎纾紓強绐紿緿繘紦弝弘紁绑綁绂紱纮紘毋張缛縟絠绔絝缄緘縅紑縬纋弼緾絔缅緬顷緛頃絾紌縓绮綺缭繚綨縥綊紎綒孧绷綳縚弸缓緩組组蠡剶劙盠绶綬缵纘鶨鴢綵幼絼糼彖绥綏縘纎繊綍纭駂紜紶繻絓繧疆缜縝颕頴绪緒结結缬纈續繥綕続鸨鴇续緈盭繨绫繬纉綾线纣紂緖纯純绖絰緻綪纡紆弖弙縳絿绠絙綆缰彊繮弻绩績緉繐缙縉纚繞經弳緁緀彌瓕絚縤绯緋纬引彏眞缈緲绰綽弔纑盄緽弫弬顚鷆絸繉纜繿紪颍潁绡綃弰絖絒剝弾绱緔紗纱糸彔彃縪繓繝旨缇緹绅紳縨縄刜弗缦縵缊緼費鄪费艴鴲緆綶缆绲絏緄缉緝绢絹弲缱紃繾绳勥犟謽强缲絽繰彈繟缋繢縜织綥絪緭繹纆細细缳繯彋絗纝缌緦綑縷縕缧縲纙繷紻縎繃绸紬綢絧絅緺缨纓縺遦纲貫網贯綱纳納纗綗繀缗緡纽紐弓縆緪纠縀縃糾緯幻紀糺乣纪纟毌彑繏缪繆纊彍絋綟颎熲缠纏繙纒编編継继緂繗纩缕彜粥彝鬻綋縖综綜綄绽纻縇綻繽縯绾綰彙緷紞綩缤紵縡缩縮紽纸緍紙弤绝絶繎繲弥絩绚絢纔絇絻縐绹綯緫绉繺弞約约緵弧絺綼絈紤斷線絑缐绵綿缴繳紩纅缚緸缥縹縛絤綇絊缃糽緗綀彁練綝絉张绛絳绣絁鄊綉缝觺肄絬綘疑繑颖穎縫欵矤乡纤纴紝缍綞綎绗緟纁絎绺綹縰綖蚃緮络絡總繌匕纥紇鄕绦终縦終緌郷飨縱嚮鄉響蠁饗織絣绻綣縌繸彅紏缮縒絴繕绊絆繶縂綐弹缯繒缔締縍絘绞纐絞緧繜缣縑缢縊绨鶸綈弱絕縁繡繣紣彇绿緑缫繅绍紹弨缁緇繍綅糿匘纨紈綛纫紉総缎緞絥紾緰绘絵縩紨弣缏絟緶縧紒給给緥繪綸缒缑緱紟縋纀紷絍纷紛纵纖緃綌绤纶维維幾畿紭繈缘毞緣毕坒丝繩蠿鸶毙纼紖綠顈鷥絲绋紼繦繼毖弜比粊皆勓鶛枈彘母纰紕綧弴統统袰紸縗缞綡弶纃緕纕繵缟縞絯鶭綂缡縭纺紡縼綷弦繂纞縴婱絃纹紋诫誡試諓试诺諾谋讛詌謀讧訌譁诓誆谟謨諎譪谨亣謹諽謳讌講谍讵詎詍諜谮譖讴讶訝衺诬護誣誮谎謊讙郭讘诹諏詜讔斈斊享誀邡亨嚲诎詘訑烹鹑鶉敦墪憝鐜撉亸熟塾孰诐詖訯弃棄謲諁育诵誦逳袤裛対译旀诒袬詒夣谲譎褭充诶誒誜訍詙譿顏詴彥誫誇譇诪诂詁諴诔誄斋诚誠訧诙詼謜旑產讈谌諶諆譭驘裒彣謟诅詛誑谖諼诳謏蠃臝诰誥赢亹斖裔贏為譌讚诜誽詵鸁谣謡哀衣羸嬴谀諛謑为誟誖詓譳诗诖詿謣詩計訐计讦謓讲诸諸謿诘詰讀譆讟谳諵誌譸読读褻譛讃讨討斌訮詽赟贇訰誈主衰请請诼諘諑訏证証语語讍諨謮譓迬譊謸评評誙誱殶瓬谑謼謔謯譃諕诽誹裵韲衷訨让讳諔詀讞誢斍卞訿讣訃就蹵鷲鹫诮誚勍詶氷誻剠谠譡讜鶁訬京譋斔齊斉亯裏裏髙詚諟刘訷齑齏齋斎亰剂齐誯劑剤螡螤谩謾齍齎恴齌谒讇謁諹课裹讕斕課謃蚉諿吝误誤训訓訲谴譴襄瓤勷谔諤譟讝譂讉詋识畆谓謂譯畗亩訵譞褱颤皽氈勯亶禀顫鸇邅鹯稟讄諰畝謱谡謖畒譨詇諯调調詷讪訕市高髜鄗敲毃髝诇諣詗鶮髞槀稾髛髚歊謰訥誷讷讗亡邙郂誳譀颏頦望肓劾讯訊诩詡盲谞諝訆永昶刻朚蝱词詞巟吂諱賌忘記誋记氓譔欬謵杗谧謐衁亥悥忞謘妄诀訣謬谬訫訳弈謶孪变奕譵蛮譒旙峦谝諞帟斒脔恋亪謆谈燮爕夑談迹谜謎鸾銮鵉挛栾変亦譧娈弯詸這毫誼谊誴亴豪諠諚这谉膏诨諢讅訦亭詝诧詫亳稁亮詑诋諙謋椉詆诡詭谵譫谄諂襃褏褎裦誂询詢谗訽詺讒讂袌諊鴍鴋鳼謅袲誃謠方詾诌诤諍誐訋离讻訩離誵谢諀謝諻訢謕诛义誅诟詬譕謉褢訤譤亵詄袠诉訴諲謤訂订谭譚諌诃訶謌誎谏諫諃誺誧訹託讬施遊誘斿诱旇话話旖譑旗訞旅膂旟旄膐许許諈誔旆諥旊诞詐诈詯誕旓誗詻謥旃斾旋讫訖旎旛旐謻旂旚族旌鷟旞诿諉帰斻旝譗旍诲誨州訸放旜旒識譲誁旘谚譾譢諺谫謭详詳議詊谙諳譩説说譄谪謫謪讁谱諩譜谤谛諦謗谘諮詨谰譐斓谦謙谥謚郎郞郎詉朗塱勆旔良剆诏郒詔訅誛欴認詪訙譅讱訒亢邟设設讼訟颃頏诊谕諭診劥詂诠詮諡諷亱斺說褒詥讑譣證譮論讥諗訡誝詤谂謒迒詅讽夜鵺於乻旕訜卒谶讖顇雜论讹訛谁誰认﨎謢谯譙訉孿奱詏卛譝訠矕紊率玅灓诣詣曫蠻畜鄐巒臠謴戀牽鑾鸞攣欒變玈壅甕譺罋饔雍玄孌谐諧彎譏誸玆谆諄譈旈堃註誩文訁亠谅諒讓譠丶乀乁謞该該詠讠諪譹议謧访訪斏誏谇誶詃言譶";

        static Dictionary<string, string> defaultMap = new Dictionary<string, string>
        {
            {@"　", ""},
            {@"『", @"‘"},
            {@"』", @"’"},
            {@"」", @"”"},
            {@"「", @"“"},
            {@"〖", @"（"},
            {@"〗", @"）"},
            {@"【", @"（"},
            {@"】", @"）"},
            {@"｀", @"`"},
            {@"１", @"1"},
            {@"２", @"2"},
            {@"３", @"3"},
            {@"４", @"4"},
            {@"５", @"5"},
            {@"６", @"6"},
            {@"７", @"7"},
            {@"８", @"8"},
            {@"９", @"9"},
            {@"０", @"0"},
            {@"－", @"-"},
            {@"＝", @"="},
            {@"［", @"["},
            {@"］", @"]"},
            {@"＼", @"\"},
            {@"；", @";"},
            {@"＇", @"'"},
            {@"，", @","},
            {@"．", @"."},
            {@"／", @"/"},
            {@"～", @"~"},
            {@"！", @"!"},
            {@"＠", @"@"},
            {@"＃", @"#"},
            {@"＄", @"$"},
            {@"％", @"%"},
            {@"＾", @"^"},
            {@"＆", @"&"},
            {@"＊", @"*"},
            {@"（", @"("},
            {@"）", @")"},
            {@"＿", @"_"},
            {@"＋", @"+"},
            {@"｛", @"{"},
            {@"｝", @"}"},
            {@"｜", @"|"},
            {@"：", @":"},
            {@"＂", "\""},
            {@"＜", @"<"},
            {@"＞", @">"},
            {@"？", @"?"},
            {@"ａ", @"a"},
            {@"ｂ", @"b"},
            {@"ｃ", @"c"},
            {@"ｄ", @"d"},
            {@"ｅ", @"e"},
            {@"ｆ", @"f"},
            {@"ｇ", @"g"},
            {@"ｈ", @"h"},
            {@"ｉ", @"i"},
            {@"ｊ", @"j"},
            {@"ｋ", @"k"},
            {@"ｌ", @"l"},
            {@"ｍ", @"m"},
            {@"ｎ", @"n"},
            {@"ｏ", @"o"},
            {@"ｐ", @"p"},
            {@"ｑ", @"q"},
            {@"ｒ", @"r"},
            {@"ｓ", @"s"},
            {@"ｔ", @"t"},
            {@"ｕ", @"u"},
            {@"ｖ", @"v"},
            {@"ｗ", @"w"},
            {@"ｘ", @"x"},
            {@"ｙ", @"y"},
            {@"ｚ", @"z"},
   ///         {@"　", @" "},
            {@"Ａ", @"A"},
            {@"Ｂ", @"B"},
            {@"Ｃ", @"C"},
            {@"Ｄ", @"D"},
            {@"Ｅ", @"E"},
            {@"Ｆ", @"F"},
            {@"Ｇ", @"G"},
            {@"Ｈ", @"H"},
            {@"Ｉ", @"I"},
            {@"Ｊ", @"J"},
            {@"Ｋ", @"K"},
            {@"Ｌ", @"L"},
            {@"Ｍ", @"M"},
            {@"Ｎ", @"N"},
            {@"Ｏ", @"O"},
            {@"Ｐ", @"P"},
            {@"Ｑ", @"Q"},
            {@"Ｒ", @"R"},
            {@"Ｓ", @"S"},
            {@"Ｔ", @"T"},
            {@"Ｕ", @"U"},
            {@"Ｖ", @"V"},
            {@"Ｗ", @"W"},
            {@"Ｘ", @"X"},
            {@"Ｙ", @"Y"},
            {@"Ｚ", @"Z"},

        };
        static private void Read ()
        {

            string PathWhiteList = "字集白名单.txt";
            if (File.Exists(PathWhiteList))
            {
                StringInfo si = new StringInfo(File.ReadAllText(PathWhiteList));

                for (int i = 0;i< si.LengthInTextElements;i++)
                {
                    string s = si.SubstringByTextElements(i,1);
                    if (!WhiteList.Contains(s)&& s != "\n")
                        WhiteList.Add(s);
                }

            }
            else
            {
                 StringInfo si = new StringInfo(defaultWhiteList);

                for (int i = 0;i< si.LengthInTextElements;i++)
                {
                    string s = si.SubstringByTextElements(i,1);
                    if (!WhiteList.Contains(s)&& s != "\n")
                        WhiteList.Add(s);
                }
      
                File.WriteAllText(PathWhiteList,defaultWhiteList);
            }

            string PathMap = "字集映射表.txt";
            if (File.Exists(PathMap))
            {
                char[] sp1 = { '\n' };

                string[] lines = File.ReadAllText(PathMap).Split(sp1, StringSplitOptions.RemoveEmptyEntries);


                foreach (string line in lines)
                {
                    //     if (line.Substring(0, 1) == "#")
                    //       continue;
                    string line_p = line.Replace("\r", "").Replace("\n", "");

                    if (!line_p.Contains("\t"))
                        continue;

                    string[] ls = line_p.Split(new char[] { '\t'}, StringSplitOptions.RemoveEmptyEntries);



                    if (ls.Length >= 2)
                        Map[ls[0]] = ls[1];
                    else if (ls.Length >=1)
                        Map[ls[0]] = "";

                }
            }
            else
            {
                Map = defaultMap;
                StreamWriter sw = new StreamWriter(PathMap);
                foreach(var p in Map)
                {
                    sw.WriteLine(p.Key + "\t"+ p.Value);
                }
                sw.Close();
            }



        }


        static public string ProcFilter(string text)
        {
            if (!inited)
            {
                Read();
                inited = true;
            }


            StringBuilder sb    = new StringBuilder();
            string def = "口";

            StringInfo si = new StringInfo(text);

            for (int i = 0; i< si.LengthInTextElements; i++)
            {
                string s = si.SubstringByTextElements(i,1);

                if (WhiteList.Count == 0)
                {
                    if (Map.ContainsKey(s))
                        s = Map[s];
                }
                else // WhiteList不为空
                {
                    if (!WhiteList.Contains(s))
                    {
                        if (Map.ContainsKey(s))
                            s = Map[s];
                        else
                            s = def;
                    }

             //       if (!WhiteList.Contains(s))
                        
                }



                sb.Append(s);
            }


            return sb.ToString();
        }
    }
}
